private-rag.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-11 Tue 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Private RAG Deployment - Live-Scripting Workflow</title>
<meta name="author" content="Andreas Wittmann" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="aw-org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="aw-org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Private RAG Deployment - Live-Scripting Workflow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge383539">1. Summary</a></li>
<li><a href="#orgc851174">2. Building Privacy-Focused RAG Platform</a>
<ul>
<li><a href="#org9ee0db3">2.1. Project Overview</a></li>
<li><a href="#orgbfb0101">2.2. Live-Scripting Methodology</a>
<ul>
<li><a href="#org188b408">2.2.1. Implementation Options</a>
<ul>
<li><a href="#orgca96909">2.2.1.1. Emacs Users</a></li>
<li><a href="#org20c6d53">2.2.1.2. Non-Emacs Users</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4708e2">2.3. Project Components</a></li>
<li><a href="#orgdb526cf">2.4. Expected Deployment Outcome</a></li>
</ul>
</li>
<li><a href="#org62ef360">3. Foundation &amp; Prerequisites</a>
<ul>
<li><a href="#orgee730b9">3.1. Environment Setup</a>
<ul>
<li><a href="#org22524dd">3.1.1. Setting the Project Foundation</a></li>
<li><a href="#orge3cb3df">3.1.2. Validating AWS Prerequisites</a></li>
</ul>
</li>
<li><a href="#orgea84fc5">3.2. Summary</a></li>
</ul>
</li>
<li><a href="#orgdffb752">4. Infrastructure as Code</a>
<ul>
<li><a href="#org18e269b">4.1. SSH Key Generation for Secure Access</a></li>
<li><a href="#org908b416">4.2. Terraform Configuration and Planning</a></li>
<li><a href="#orgf41163e">4.3. Infrastructure Deployment Planning</a></li>
<li><a href="#org4e02851">4.4. Infrastructure Deployment Execution</a></li>
<li><a href="#org30c87c4">4.5. SSH Configuration for Easy Access</a></li>
<li><a href="#org27cb8c6">4.6. EC2 Instance Selection and Upgrading</a>
<ul>
<li><a href="#orgb41814f">4.6.1. Recommended EC2 Instance Types for RAG Workloads</a>
<ul>
<li><a href="#org57998c8">4.6.1.1. Recommendations</a></li>
</ul>
</li>
<li><a href="#orgb68e950">4.6.2. Upgrading to a Larger Instance Type with Terraform</a>
<ul>
<li><a href="#org1cbabb8">4.6.2.1. Steps to Upgrade</a></li>
<li><a href="#orgcc85aaa">4.6.2.2. Why This Method Is Best/Fastest</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org756ae21">4.7. Infrastructure Live-Cycle Operations</a></li>
<li><a href="#org2c43af9">4.8. Summary</a></li>
</ul>
</li>
<li><a href="#org4c1dbac">5. Development Environment Setup</a>
<ul>
<li><a href="#org05e5b33">5.1. Complete Docker Engine and Tools Installation</a>
<ul>
<li><a href="#orgd960c30">5.1.1. Docker Engine Installation</a></li>
<li><a href="#org09b3d60">5.1.2. Docker Service Configuration</a></li>
<li><a href="#orga4939b6">5.1.3. Lazydocker Installation</a></li>
<li><a href="#org935b1b4">5.1.4. GitHub CLI Installation</a></li>
<li><a href="#orgf5605ad">5.1.5. Docker and Docker Compose Verification</a></li>
<li><a href="#org2b7cfd2">5.1.6. Python Development Tools Installation</a></li>
<li><a href="#orgaa59a09">5.1.7. Development Environment Summary</a></li>
</ul>
</li>
<li><a href="#org07dd68c">5.2. Summary</a></li>
</ul>
</li>
<li><a href="#org49ea314">6. Core RagFlow Deployment</a>
<ul>
<li><a href="#orgcda4269">6.1. Basic Ragflow Setup</a></li>
<li><a href="#org5b3acbc">6.2. HTTPS Setup with Self-Signed Certificate</a>
<ul>
<li><a href="#orgd6548be">6.2.1. Step 1: Generate Self-Signed SSL Certificate**</a></li>
<li><a href="#orgce51373">6.2.2. Step 2: Modify Nginx Configuration**</a></li>
<li><a href="#orgc9eac43">6.2.3. Step 3: Update Docker Compose Configuration**</a></li>
<li><a href="#org8d23bbc">6.2.4. Step 4: Restart RAGFlow Services**</a></li>
<li><a href="#orgbbf6ea1">6.2.5. Step 5: Test HTTPS Access**</a></li>
</ul>
</li>
<li><a href="#orgcef3740">6.3. Use Case: Access RagFlow via SSH-Tunnel</a></li>
<li><a href="#org2e26020">6.4. Summary</a></li>
</ul>
</li>
<li><a href="#orgbc32003">7. Advanced Features - Document Processing</a>
<ul>
<li><a href="#org4d99ef0">7.1. Document Ingestion and Processing</a>
<ul>
<li><a href="#org06c1286">7.1.1. Upload Documents</a></li>
<li><a href="#orgd5c94d2">7.1.2. Configure Knowledge Base</a></li>
<li><a href="#org3b3c994">7.1.3. Test RAG Queries</a></li>
</ul>
</li>
<li><a href="#org7808701">7.2. Summary</a></li>
</ul>
</li>
<li><a href="#org5f9d052">8. Infrastructure Cleanup</a>
<ul>
<li><a href="#org5877c0a">8.1. Cleanup Philosophy</a></li>
<li><a href="#org8a52ddb">8.2. Stop RagFlow Services</a></li>
<li><a href="#orgbb6eed9">8.3. Terminate EC2 Instance with Terraform</a></li>
<li><a href="#orgf56b1cb">8.4. Clean Up Local SSH Configuration</a></li>
<li><a href="#org64b1429">8.5. Clean Up Terraform State Files</a></li>
<li><a href="#org39e7495">8.6. Verify Complete Cleanup</a></li>
<li><a href="#orgec46671">8.7. Cost Optimization Notes</a></li>
<li><a href="#orgf1e757f">8.8. Summary</a></li>
</ul>
</li>
<li><a href="#orgf579939">9. Appendix: GitHub Self-Hosted Runner Setup</a>
<ul>
<li><a href="#orgd20c5f6">9.1. GitHub Runner for CI/CD Testing on AWS</a>
<ul>
<li><a href="#orgd850d03">9.1.1. Prerequisites and Security Group Configuration</a></li>
<li><a href="#org2d378c0">9.1.2. GitHub Runner Installation and Configuration</a></li>
<li><a href="#orgabc7213">9.1.3. Runner Registration with GitHub</a></li>
<li><a href="#orgef8d2a7">9.1.4. Running the Runner as a Service</a></li>
<li><a href="#orgef5347d">9.1.5. Verifying Runner Status</a></li>
<li><a href="#orgee4d825">9.1.6. Testing the Runner with a Sample Workflow</a></li>
<li><a href="#org5f07ed2">9.1.7. Monitoring and Troubleshooting</a></li>
<li><a href="#orgf96d082">9.1.8. Removing the Runner (if needed)</a></li>
</ul>
</li>
<li><a href="#org0e05c45">9.2. Summary</a></li>
</ul>
</li>
<li><a href="#org56b48e2">10. Appendix: Remote Desktop Access with RustDesk</a>
<ul>
<li><a href="#orgeb9f4e7">10.1. RustDesk Installation and Configuration</a>
<ul>
<li><a href="#org7f7a988">10.1.1. Prerequisites and Security Group Updates</a></li>
<li><a href="#org1655a52">10.1.2. RustDesk Installation on EC2 Instance</a></li>
<li><a href="#orge338b16">10.1.3. RustDesk Client Setup on Local Machine</a></li>
<li><a href="#orgceb07b4">10.1.4. Establishing Remote Desktop Connection</a></li>
</ul>
</li>
<li><a href="#org97559a6">10.2. Summary</a></li>
</ul>
</li>
<li><a href="#org92d6844">11. Appendix: Remote Desktop Access with NoMachine</a>
<ul>
<li><a href="#org701c4ca">11.1. NoMachine Installation and Configuration</a>
<ul>
<li><a href="#org181d3d5">11.1.1. Prerequisites and Security Group Updates</a></li>
<li><a href="#org9392c6a">11.1.2. Desktop Environment Installation</a></li>
<li><a href="#org21dd3e6">11.1.3. NoMachine Server Installation</a></li>
<li><a href="#org68350ba">11.1.4. Firewall Configuration on Server</a></li>
<li><a href="#orga9e5526">11.1.5. Testing NoMachine Connection</a></li>
<li><a href="#orgac68aa5">11.1.6. Troubleshooting Common Issues</a></li>
<li><a href="#org0e502f5">11.1.7. High Resolution Configuration with XDummy Driver</a></li>
<li><a href="#orgb0c76d3">11.1.8. German Keyboard Configuration Fix</a>
<ul>
<li><a href="#orga3391f4">11.1.8.1. Problem Diagnosis</a></li>
<li><a href="#org1520e36">11.1.8.2. Solution: Update XFCE Keyboard Configuration</a></li>
<li><a href="#org40c7dbe">11.1.8.3. Solution: Add Session Startup Script</a></li>
<li><a href="#org297437c">11.1.8.4. Applying the Fix</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org80b6a64">11.2. Summary</a></li>
</ul>
</li>
<li><a href="#orgca67355">12. End</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge383539" class="outline-2">
<h2 id="orge383539"><span class="section-number-2">1.</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>This document outlines a live-scripting methodology for deploying RagFlow, an open-source RAG platform, on AWS using Terraform, through executable code blocks that ensure reproducible infrastructure setup. It covers HTTPS configuration, Docker containerization, SSH access, and appendices for GitHub Actions runners and remote desktop tools, bridging manual workflows with automated deployments.</i>
</p>
<ul class="org-ul">
<li><b>HTML Version:</b> <a href="private-rag.html">private-rag.html</a></li>
<li><b>PDF Version:</b> <a href="private-rag.pdf">private-rag.pdf</a></li>
<li><b>GitHub:</b> <a href="https://github.com/andreaswittmann/private-rag/tree/main">https://github.com/andreaswittmann/private-rag/tree/main</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc851174" class="outline-2">
<h2 id="orgc851174"><span class="section-number-2">2.</span> Building Privacy-Focused RAG Platform</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9ee0db3" class="outline-3">
<h3 id="org9ee0db3"><span class="section-number-3">2.1.</span> Project Overview</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This project uses the live-scripting methodology to create an example configuration of the open-source project RagFlow. Live-scripting represents an intermediate approach between manual command-line work and fully automated CI/CD pipelines, enabling the development of documented, shareable, and reproducible solutions.
</p>

<p>
Using Infrastructure as Code methods with Terraform, an AWS environment is established as a platform for RagFlow installation. The example demonstrates all necessary configuration and software tool installations required for the project. Appendices cover additional topics such as GitHub Runner setup and graphical user interface configuration.
</p>
</div>
</div>
<div id="outline-container-orgbfb0101" class="outline-3">
<h3 id="orgbfb0101"><span class="section-number-3">2.2.</span> Live-Scripting Methodology</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The deployment uses live-scripting methodology to transform static documentation into executable workflows. Code blocks execute directly in Emacs (F4 key) or copy to any terminal, creating a bridge between documentation and execution.
</p>

<p>
Based on the [live-scripting methodology](<a href="https://github.com/andreaswittmann/live-scripting">https://github.com/andreaswittmann/live-scripting</a>), this approach provides:
</p>

<ul class="org-ul">
<li>Executable documentation with current and functional code blocks</li>
<li>Multi-format publishing from single source to Org, HTML, and PDF</li>
<li>Reproducible deployments with consistent infrastructure setup</li>
<li>Version control integration through plain-text format</li>
</ul>
</div>
<div id="outline-container-org188b408" class="outline-4">
<h4 id="org188b408"><span class="section-number-4">2.2.1.</span> Implementation Options</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<div id="outline-container-orgca96909" class="outline-5">
<h5 id="orgca96909"><span class="section-number-5">2.2.1.1.</span> Emacs Users</h5>
<div class="outline-text-5" id="text-2-2-1-1">
<p>
Configure live-scripting with this Emacs Lisp function:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">defun</span> <span style="color: #006699;">send-line-to-vterm</span> ()
  <span style="color: #036A07;">"Send region if active, or current line to vterm buffer."</span>
  (<span style="color: #0000FF; font-weight: bold;">interactive</span>)
  (<span style="color: #0000FF; font-weight: bold;">if</span> (region-active-p)
      (send-region <span style="color: #008000;">"*vterm*"</span> (region-beginning) (region-end))
    (my-select-current-line)
    (send-region <span style="color: #008000;">"*vterm*"</span> (region-beginning) (region-end)))
  (deactivate-mark))

(global-set-key [f4] 'send-line-to-vterm)
</pre>
</div>
</div>
</div>
<div id="outline-container-org20c6d53" class="outline-5">
<h5 id="org20c6d53"><span class="section-number-5">2.2.1.2.</span> Non-Emacs Users</h5>
<div class="outline-text-5" id="text-2-2-1-2">
<p>
Copy code blocks to any terminal - the methodology maintains precision across tools.
</p>

<p>
The deployment follows phases from environment setup through advanced features, with each step documented using executable code blocks for reproducibility.
</p>
</div>
</div>
</div>
</div>
