private-rag.org
** Project Components

- Self-hosted RagFlow with local document processing for privacy control
- Production-ready foundation with SSL/HTTPS, Docker containerization, and infrastructure automation
- Advanced RAG capabilities including document ingestion, vector search, and knowledge base management
- Reproducible methodology using live-scripting workflow for consistent deployment

** Expected Deployment Outcome

The workflow produces a functioning HTTPS-enabled RagFlow instance on AWS, capable of document processing and RAG-based AI responses with full user control.

* Foundation & Prerequisites

** Environment Setup

These steps establish the development environment and validate prerequisites.

*** Setting the Project Foundation

This establishes the base project directory and validates AWS network prerequisites.

#+begin_src bash
# Listing: Project environment setup
# Establishing the base directory for the RAG project
bash
PROJECT_DIR="/Users/$(whoami)/LocalProjects/RagFlow/private-rag"
cd "$PROJECT_DIR"
pwd
ls -la

# Verify we're in the right location
echo "Working in: $PROJECT_DIR"

# Set AWS profile for this session
export AWS_PROFILE=default  # Adjust as needed
echo $AWS_PROFILE

## create default VPC if it does not exist
aws ec2 create-default-vpc
## check if the default vpc is created
aws ec2 describe-vpcs --filters "Name=isDefault,Values=true" --query "Vpcs[0].VpcId" --output text

#+end_src

*Result:* Project environment is configured and AWS default VPC is available for deployment.

*** Validating AWS Prerequisites

This confirms AWS environment configuration for deployment requirements.

#+begin_src bash
# Listing: AWS environment validation
# Ensuring AWS access and basic services availability

# Test basic AWS connectivity
aws s3 ls

# Verify AWS identity and permissions
aws sts get-caller-identity

# Verify SSH key is available for EC2 access
ls -la ~/.ssh/

# Validate required tools are installed
terraform --version
git --version
docker --version
#+end_src

*Result:* AWS credentials and required tools are validated for infrastructure deployment.

** Summary

The foundation phase establishes the development environment and validates prerequisites. Project directory structure is configured, AWS credentials verified, and required tools confirmed operational. This groundwork enables reproducible infrastructure deployment through live-scripting methodology.

* Infrastructure as Code
** SSH Key Generation for Secure Access

This creates dedicated SSH keypairs for EC2 instance access and stores the public key for Terraform.

#+begin_src bash
# Listing: SSH key generation for EC2 access
# Creating dedicated SSH keys for secure instance access

cd "$PROJECT_DIR"

# Generate a new SSH key pair specifically for RagFlow
ssh-keygen -t rsa -b 4096 -f ~/.ssh/ragflow_key -N ""
y
# Display the public key for use in Terraform variables
cat ~/.ssh/ragflow_key.pub

# Store public key in environment variable
export TF_VAR_SSH_PUBLIC_KEY="$(cat ~/.ssh/ragflow_key.pub)"
echo "SSH public key configured: $TF_VAR_SSH_PUBLIC_KEY"
#+end_src

*Result:* SSH keypair is generated and public key is exported for infrastructure provisioning.

** Terraform Configuration and Planning

This prepares the Terraform configuration files and validates the infrastructure setup.

#+begin_src bash
# Listing: Terraform environment preparation
# Setting up infrastructure configuration

cd "$PROJECT_DIR/terraform"

# Create terraform variables file with our configuration
cat > terraform.tfvars << EOF
# Generated tfvars file - $(date)
aws_region       = "eu-central-1"
instance_type    = "t3.medium"
root_volume_size = 50
root_volume_type = "gp3"
allowed_ip       = "0.0.0.0/0"
ssh_public_key   = "${TF_VAR_SSH_PUBLIC_KEY}"
ec2_name         = "EC2-RagFlow"
environment      = "development"
project          = "ragflow"
ssh_cidr_blocks  = ["0.0.0.0/0"]
EOF

# Review our configuration
cat terraform.tfvars

# Initialize Terraform
terraform init

# Format and validate our configuration
terraform fmt
terraform validate
#+end_src

*Result:* Terraform configuration is initialized and validated for deployment.

