private-rag.html
<div id="outline-container-orga4708e2" class="outline-3">
<h3 id="orga4708e2"><span class="section-number-3">2.3.</span> Project Components</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Self-hosted RagFlow with local document processing for privacy control</li>
<li>Production-ready foundation with SSL/HTTPS, Docker containerization, and infrastructure automation</li>
<li>Advanced RAG capabilities including document ingestion, vector search, and knowledge base management</li>
<li>Reproducible methodology using live-scripting workflow for consistent deployment</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb526cf" class="outline-3">
<h3 id="orgdb526cf"><span class="section-number-3">2.4.</span> Expected Deployment Outcome</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The workflow produces a functioning HTTPS-enabled RagFlow instance on AWS, capable of document processing and RAG-based AI responses with full user control.
</p>
</div>
</div>
</div>
<div id="outline-container-org62ef360" class="outline-2">
<h2 id="org62ef360"><span class="section-number-2">3.</span> Foundation &amp; Prerequisites</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgee730b9" class="outline-3">
<h3 id="orgee730b9"><span class="section-number-3">3.1.</span> Environment Setup</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These steps establish the development environment and validate prerequisites.
</p>
</div>
<div id="outline-container-org22524dd" class="outline-4">
<h4 id="org22524dd"><span class="section-number-4">3.1.1.</span> Setting the Project Foundation</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
This establishes the base project directory and validates AWS network prerequisites.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Project environment setup</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Establishing the base directory for the RAG project</span>
bash
<span style="color: #BA36A5;">PROJECT_DIR</span>=<span style="color: #008000;">"/Users/$(whoami)/LocalProjects/RagFlow/private-rag"</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR"</span>
<span style="color: #006FE0;">pwd</span>
ls -la

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify we're in the right location</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Working in: $PROJECT_DIR"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set AWS profile for this session</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">AWS_PROFILE</span>=default  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Adjust as needed</span>
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">AWS_PROFILE</span>

<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">create default VPC if it does not exist</span>
aws ec2 create-default-vpc
<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">check if the default vpc is created</span>
aws ec2 describe-vpcs --filters <span style="color: #008000;">"Name=isDefault,Values=true"</span> --query <span style="color: #008000;">"Vpcs[0].VpcId"</span> --output text

</pre>
</div>

<p>
<b>Result:</b> Project environment is configured and AWS default VPC is available for deployment.
</p>
</div>
</div>
<div id="outline-container-orge3cb3df" class="outline-4">
<h4 id="orge3cb3df"><span class="section-number-4">3.1.2.</span> Validating AWS Prerequisites</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This confirms AWS environment configuration for deployment requirements.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: AWS environment validation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Ensuring AWS access and basic services availability</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test basic AWS connectivity</span>
aws s3 ls

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify AWS identity and permissions</span>
aws sts get-caller-identity

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify SSH key is available for EC2 access</span>
ls -la ~/.ssh/

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate required tools are installed</span>
terraform --version
git --version
docker --version
</pre>
</div>

<p>
<b>Result:</b> AWS credentials and required tools are validated for infrastructure deployment.
</p>
</div>
</div>
</div>
<div id="outline-container-orgea84fc5" class="outline-3">
<h3 id="orgea84fc5"><span class="section-number-3">3.2.</span> Summary</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The foundation phase establishes the development environment and validates prerequisites. Project directory structure is configured, AWS credentials verified, and required tools confirmed operational. This groundwork enables reproducible infrastructure deployment through live-scripting methodology.
</p>
</div>
</div>
</div>
<div id="outline-container-orgdffb752" class="outline-2">
<h2 id="orgdffb752"><span class="section-number-2">4.</span> Infrastructure as Code</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org18e269b" class="outline-3">
<h3 id="org18e269b"><span class="section-number-3">4.1.</span> SSH Key Generation for Secure Access</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This creates dedicated SSH keypairs for EC2 instance access and stores the public key for Terraform.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: SSH key generation for EC2 access</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating dedicated SSH keys for secure instance access</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a new SSH key pair specifically for RagFlow</span>
ssh-keygen -t rsa -b 4096 -f ~/.ssh/ragflow_key -N <span style="color: #008000;">""</span>
y
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display the public key for use in Terraform variables</span>
cat ~/.ssh/ragflow_key.pub

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Store public key in environment variable</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">TF_VAR_SSH_PUBLIC_KEY</span>=<span style="color: #008000;">"$(cat ~/.ssh/ragflow_key.pub)"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"SSH public key configured: $TF_VAR_SSH_PUBLIC_KEY"</span>
</pre>
</div>

<p>
<b>Result:</b> SSH keypair is generated and public key is exported for infrastructure provisioning.
</p>
</div>
</div>
<div id="outline-container-org908b416" class="outline-3">
<h3 id="org908b416"><span class="section-number-3">4.2.</span> Terraform Configuration and Planning</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This prepares the Terraform configuration files and validates the infrastructure setup.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Terraform environment preparation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Setting up infrastructure configuration</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create terraform variables file with our configuration</span>
cat &gt; terraform.tfvars &lt;&lt; EOF
<span style="color: #0000ff; background-color: #EEF5FE;"># Generated tfvars file - $(date)</span>
<span style="color: #0000ff; background-color: #EEF5FE;">aws_region       = "eu-central-1"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">instance_type    = "t3.medium"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">root_volume_size = 50</span>
<span style="color: #0000ff; background-color: #EEF5FE;">root_volume_type = "gp3"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">allowed_ip       = "0.0.0.0/0"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">ssh_public_key   = "${TF_VAR_SSH_PUBLIC_KEY}"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">ec2_name         = "EC2-RagFlow"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">environment      = "development"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">project          = "ragflow"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">ssh_cidr_blocks  = ["0.0.0.0/0"]</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review our configuration</span>
cat terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Initialize Terraform</span>
terraform init

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Format and validate our configuration</span>
terraform fmt
terraform validate
</pre>
</div>

<p>
<b>Result:</b> Terraform configuration is initialized and validated for deployment.
</p>
</div>
</div>
