private-rag.org
** Infrastructure Deployment Planning

This creates the deployment plan and reviews resource changes before applying them.

#+begin_src bash
# Listing: Terraform deployment planning
# Creating and reviewing the deployment plan

# Generate deployment plan
terraform plan -out=tfplan -var-file=terraform.tfvars

# Create human-readable plan
terraform show -json tfplan > tfplan.json
cat tfplan.json | jq > tfplan.pretty.json

# Review what resources will be created
echo "Resources to be created:"
cat tfplan.json | jq '.resource_changes[] | {address: .address, action: .change.actions[0]}'

# Summary of planned changes
cat tfplan.json | jq '.resource_changes | group_by(.change.actions[0]) | map({action: .[0].change.actions[0], count: length})'
#+end_src

*Result:* Deployment plan is generated and resource changes are reviewed for approval.

** Infrastructure Deployment Execution

This executes the Terraform plan to create the AWS infrastructure resources.

#+begin_src bash
# Listing: AWS infrastructure deployment
# Creating the infrastructure resources

# Execute the deployment plan
terraform apply tfplan
terraform apply
yes

# Capture and display outputs
terraform output

# List our EC2 instances
aws ec2 describe-instances \
  --query 'Reservations[*].Instances[*].[InstanceId, InstanceType, Tags[?Key==`Name`]|[0].Value, State.Name]' \
  --output text

# Get our instance details - get only the first/latest instance ID
instance_id=$(aws ec2 describe-instances \
  --filters "Name=tag:Name,Values=EC2-RagFlow" "Name=instance-state-name,Values=running,pending,stopping,stopped" \
  --query 'Reservations[*].Instances[*].[InstanceId]' \
  --output text | head -n1)
echo "Instance ID: $instance_id"


public_ip=$(aws ec2 describe-instances \
  --instance-ids "$instance_id" \
  --query 'Reservations[*].Instances[*].[PublicIpAddress]' \
  --output text)
echo "Public IP: $public_ip"
exit
#+end_src

*Result:* AWS infrastructure is deployed and EC2 instance details are captured for subsequent configuration.

** SSH Configuration for Easy Access

This establishes convenient SSH access configuration and tests connectivity to the deployed instance.

#+begin_src bash
# Listing: SSH configuration setup
# Establishing convenient SSH access
pwd
# Test initial SSH connection
ssh -i ~/.ssh/ragflow_key ubuntu@"$public_ip" 'whoami && pwd'
yes
# Create SSH config entry for easy access
open ~/.ssh/config # we may delete an old entry first, manually
cat >> ~/.ssh/config << EOF
# SSH over EC2 - RagFlow Privacy RAG Project
Host EC2-RagFlow
    HostName $public_ip
    User ubuntu
    IdentityFile ~/.ssh/ragflow_key
EOF
## use a perl one-liner to grep these lines from the ssh-config file.
perl -nE 'print if /Host EC2-RagFlow/ .. /yesEOF/' ~/.ssh/config
#bbedit ~/.ssh/config

# Test SSH with hostname
ssh EC2-RagFlow 'whoami && date'

#+end_src

*Result:* SSH configuration is established and remote access to the EC2 instance is verified.

** EC2 Instance Selection and Upgrading

*** Recommended EC2 Instance Types for RAG Workloads

Here is a list of recommended EC2 instance types suitable for RAG (Retrieval-Augmented Generation) workloads like RagFlow, which typically require significant memory for model inference, vector embeddings, and data processing. I've focused on instances with at least 20 GB RAM, prioritizing memory-optimized types (R series) for better performance. All recommendations are for the ~eu-central-1~ region, with approximate on-demand pricing (as of late 2024; prices may vary—check AWS Pricing Calculator for current rates). Network speed refers to the maximum bandwidth.

| Instance Type | RAM (GB) | CPU (vCPUs) | Network Speed | Approx. Price/Hour (USD) | Notes |
|---------------|----------|-------------|---------------|---------------------------|-------|
| r5.xlarge    | 32       | 4           | Up to 10 Gbps | $0.25                    | Balanced memory-optimized instance; good for moderate RAG workloads with cost efficiency. |
| r6g.xlarge   | 32       | 4           | Up to 10 Gbps | $0.21                    | Graviton-based (ARM); cheaper than r5 for similar specs; ideal if you prefer lower costs. |
| r7g.xlarge   | 32       | 4           | Up to 15 Gbps | $0.20                    | Latest Graviton generation; higher network speed for faster data transfers; excellent for RAG with I/O demands. |
| r5.2xlarge   | 64       | 8           | Up to 10 Gbps | $0.50                    | Doubles RAM and CPU; suitable for larger RAG models or concurrent users. |
| m5.2xlarge   | 32       | 8           | Up to 10 Gbps | $0.38                    | General-purpose alternative; more CPU cores if your workload is compute-heavy alongside memory needs. |

