private-rag.html
<div id="outline-container-orgf41163e" class="outline-3">
<h3 id="orgf41163e"><span class="section-number-3">4.3.</span> Infrastructure Deployment Planning</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This creates the deployment plan and reviews resource changes before applying them.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Terraform deployment planning</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating and reviewing the deployment plan</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate deployment plan</span>
terraform plan -out=tfplan -var-file=terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create human-readable plan</span>
terraform show -json tfplan &gt; tfplan.json
cat tfplan.json | jq &gt; tfplan.pretty.json

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review what resources will be created</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Resources to be created:"</span>
cat tfplan.json | jq <span style="color: #008000;">'.resource_changes[] | {address: .address, action: .change.actions[0]}'</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Summary of planned changes</span>
cat tfplan.json | jq <span style="color: #008000;">'.resource_changes | group_by(.change.actions[0]) | map({action: .[0].change.actions[0], count: length})'</span>
</pre>
</div>

<p>
<b>Result:</b> Deployment plan is generated and resource changes are reviewed for approval.
</p>
</div>
</div>
<div id="outline-container-org4e02851" class="outline-3">
<h3 id="org4e02851"><span class="section-number-3">4.4.</span> Infrastructure Deployment Execution</h3>
<div class="outline-text-3" id="text-4-4">
<p>
This executes the Terraform plan to create the AWS infrastructure resources.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: AWS infrastructure deployment</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating the infrastructure resources</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Execute the deployment plan</span>
terraform apply tfplan
terraform apply
yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Capture and display outputs</span>
terraform output

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List our EC2 instances</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId, InstanceType, Tags[?Key==`Name`]|[0].Value, State.Name]'</span> <span style="color: #008000;">\</span>
  --output text

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Get our instance details - get only the first/latest instance ID</span>
<span style="color: #BA36A5;">instance_id</span>=$(aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow"</span> <span style="color: #008000;">"Name=instance-state-name,Values=running,pending,stopping,stopped"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId]'</span> <span style="color: #008000;">\</span>
  --output text | head -n1)
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Instance ID: $instance_id"</span>


<span style="color: #BA36A5;">public_ip</span>=$(aws ec2 describe-instances <span style="color: #008000;">\</span>
  --instance-ids <span style="color: #008000;">"$instance_id"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[PublicIpAddress]'</span> <span style="color: #008000;">\</span>
  --output text)
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Public IP: $public_ip"</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> AWS infrastructure is deployed and EC2 instance details are captured for subsequent configuration.
</p>
</div>
</div>
<div id="outline-container-org30c87c4" class="outline-3">
<h3 id="org30c87c4"><span class="section-number-3">4.5.</span> SSH Configuration for Easy Access</h3>
<div class="outline-text-3" id="text-4-5">
<p>
This establishes convenient SSH access configuration and tests connectivity to the deployed instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: SSH configuration setup</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Establishing convenient SSH access</span>
<span style="color: #006FE0;">pwd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test initial SSH connection</span>
ssh -i ~/.ssh/ragflow_key ubuntu@<span style="color: #008000;">"$public_ip"</span> <span style="color: #008000;">'whoami &amp;&amp; pwd'</span>
yes
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create SSH config entry for easy access</span>
open ~/.ssh/config <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">we may delete an old entry first, manually</span>
cat &gt;&gt; ~/.ssh/config &lt;&lt; EOF
<span style="color: #0000ff; background-color: #EEF5FE;"># SSH over EC2 - RagFlow Privacy RAG Project</span>
<span style="color: #0000ff; background-color: #EEF5FE;">Host EC2-RagFlow</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    HostName $public_ip</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    User ubuntu</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    IdentityFile ~/.ssh/ragflow_key</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>
<span style="color: #8D8D84;">## </span><span style="color: #8D8D84; font-style: italic;">use a perl one-liner to grep these lines from the ssh-config file.</span>
perl -nE <span style="color: #008000;">'print if /Host EC2-RagFlow/ .. /yesEOF/'</span> ~/.ssh/config
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">bbedit ~/.ssh/config</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test SSH with hostname</span>
ssh EC2-RagFlow <span style="color: #008000;">'whoami &amp;&amp; date'</span>

</pre>
</div>

<p>
<b>Result:</b> SSH configuration is established and remote access to the EC2 instance is verified.
</p>
</div>
</div>
<div id="outline-container-org27cb8c6" class="outline-3">
<h3 id="org27cb8c6"><span class="section-number-3">4.6.</span> EC2 Instance Selection and Upgrading</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-orgb41814f" class="outline-4">
<h4 id="orgb41814f"><span class="section-number-4">4.6.1.</span> Recommended EC2 Instance Types for RAG Workloads</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Here is a list of recommended EC2 instance types suitable for RAG (Retrieval-Augmented Generation) workloads like RagFlow, which typically require significant memory for model inference, vector embeddings, and data processing. I've focused on instances with at least 20 GB RAM, prioritizing memory-optimized types (R series) for better performance. All recommendations are for the <code>eu-central-1</code> region, with approximate on-demand pricing (as of late 2024; prices may vary—check AWS Pricing Calculator for current rates). Network speed refers to the maximum bandwidth.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Instance Type</th>
<th scope="col" class="org-right">RAM (GB)</th>
<th scope="col" class="org-right">CPU (vCPUs)</th>
<th scope="col" class="org-left">Network Speed</th>
<th scope="col" class="org-left">Approx. Price/Hour (USD)</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">r5.xlarge</td>
<td class="org-right">32</td>
<td class="org-right">4</td>
<td class="org-left">Up to 10 Gbps</td>
<td class="org-left">$0.25</td>
<td class="org-left">Balanced memory-optimized instance; good for moderate RAG workloads with cost efficiency.</td>
</tr>

<tr>
<td class="org-left">r6g.xlarge</td>
<td class="org-right">32</td>
<td class="org-right">4</td>
<td class="org-left">Up to 10 Gbps</td>
<td class="org-left">$0.21</td>
<td class="org-left">Graviton-based (ARM); cheaper than r5 for similar specs; ideal if you prefer lower costs.</td>
</tr>

<tr>
<td class="org-left">r7g.xlarge</td>
<td class="org-right">32</td>
<td class="org-right">4</td>
<td class="org-left">Up to 15 Gbps</td>
<td class="org-left">$0.20</td>
<td class="org-left">Latest Graviton generation; higher network speed for faster data transfers; excellent for RAG with I/O demands.</td>
</tr>

<tr>
<td class="org-left">r5.2xlarge</td>
<td class="org-right">64</td>
<td class="org-right">8</td>
<td class="org-left">Up to 10 Gbps</td>
<td class="org-left">$0.50</td>
<td class="org-left">Doubles RAM and CPU; suitable for larger RAG models or concurrent users.</td>
</tr>

<tr>
<td class="org-left">m5.2xlarge</td>
<td class="org-right">32</td>
<td class="org-right">8</td>
<td class="org-left">Up to 10 Gbps</td>
<td class="org-left">$0.38</td>
<td class="org-left">General-purpose alternative; more CPU cores if your workload is compute-heavy alongside memory needs.</td>
</tr>
</tbody>
</table>
</div>
