private-rag.org
**** Recommendations
- *For most RAG setups*: Start with ~r5.xlarge~ or ~r6g.xlarge~ for a balance of memory, performance, and cost.
- *For high-performance needs*: Opt for ~r7g.xlarge~ if network speed is critical (e.g., for real-time inference).
- *Scaling up*: If 32 GB isn't enough, ~r5.2xlarge~ provides 64 GB without overkill.
- *Considerations*: R series are optimized for memory-intensive tasks. Use Spot instances for cost savings (~50-70% off on-demand). Monitor with CloudWatch for actual usage. If your workload involves GPUs (e.g., for advanced ML), consider P or G series, but they exceed basic RAG needs and are pricier.

*** Upgrading to a Larger Instance Type with Terraform

The best and fastest way to upgrade your EC2 instance to one with more memory is to update your Terraform configuration and apply the changes. This approach is automated, ensures consistency, and avoids manual errors.

**** Steps to Upgrade
1. *Update the Terraform Variables*:
   - Edit ~terraform/terraform.tfvars~ and change ~instance_type = "t3.medium"~ to your desired instance type (e.g., ~instance_type = "r5.xlarge"~).
   - Alternatively, update the default in ~terraform/variables.tf~ if you prefer not to modify ~tfvars~.

2. *Apply the Changes*:
   - Navigate to the ~terraform/~ directory in your terminal.
   - Run ~terraform plan~ to preview the changes (it will show the instance type update).
   - Run ~terraform apply~ to execute the upgrade. Terraform will:
     - Stop the existing instance.
     - Change the instance type.
     - Restart the instance with the new configuration.
   - This process typically takes 5-10 minutes, depending on AWS availability.

**** Why This Method Is Best/Fastest
- *Automation*: Terraform handles the entire process, ensuring consistency and avoiding manual errors.
- *Minimal Downtime*: The stop/change/start cycle is efficient for instance type changes.
- *No Data Loss*: Your EBS root volume (50 GB) and Elastic IP remain attached.
- *Cost*: Monitor via AWS Cost Explorer. R series instances are reasonably priced.
- *Alternatives Considered*:
  - Manual AWS Console change: Faster for one-off updates but not recommended for Terraform-managed infrastructure, as it can cause drift.
  - Creating a new instance: Slower and requires data migration.

If you encounter issues (e.g., instance family incompatibility), Terraform will prompt you. Ensure your AWS credentials are configured and the instance is not in use during the upgrade.

#+begin_src bash
# Listing: Upgrading EC2 instance type with Terraform
# Updating instance configuration and applying changes

# Navigate to the Terraform directory
cd "$PROJECT_DIR/terraform"

# Update the instance type in terraform.tfvars (replace 'r5.xlarge' with your desired type)
sed -i 's/instance_type    = "t3.medium"/instance_type    = "r5.xlarge"/g' terraform.tfvars

# Review the updated configuration
cat terraform.tfvars

# Generate and review the deployment plan
terraform plan -out=tfplan -var-file=terraform.tfvars

# Apply the changes to upgrade the instance
terraform apply tfplan

# Verify the instance has been upgraded
aws ec2 describe-instances \
  --filters "Name=tag:Name,Values=EC2-RagFlow" \
  --query 'Reservations[*].Instances[*].[InstanceType, State.Name]' \
  --output text
#+end_src

*Result:* EC2 instance type has been successfully upgraded to the new configuration with increased memory capacity.

** Infrastructure Live-Cycle Operations

This section provides procedures for managing the EC2 instance lifecycle - starting and stopping the instance when returning to work sessions after periods of inactivity.

#+begin_src bash
exit
pwd


# Initialize project environment
PROJECT_DIR="/Users/$(whoami)/LocalProjects/RagFlow/private-rag"
cd "$PROJECT_DIR"
export AWS_PROFILE=default

# Get instance ID
instance_id=$(aws ec2 describe-instances --filters "Name=tag:Name,Values=EC2-RagFlow" --query 'Reservations[*].Instances[*].[InstanceId]' --output text | head -n1)
echo $instance_id

### STATUS: Get current instance state
aws ec2 describe-instances --instance-ids "$instance_id" --query 'Reservations[*].Instances[*].[State.Name]' --output text

### START:  Start and wait for running state
aws ec2 start-instances --instance-ids "$instance_id"
while [ "$(aws ec2 describe-instances --instance-ids "$instance_id" --query "Reservations[0].Instances[0].State.Name" --output text)" != "running" ]; do echo -n "."; sleep 1; done; echo " ✅ running"


# Get public IP
public_ip=$(aws ec2 describe-instances --instance-ids "$instance_id" --query 'Reservations[*].Instances[*].[PublicIpAddress]' --output text)
echo "Instance running at: $public_ip"

# Test SSH connection
ssh EC2-RagFlow 'whoami && date && uptime'


### STOP: stop  the instance and wait for stopped state
aws ec2 stop-instances --instance-ids "$instance_id"
while [ "$(aws ec2 describe-instances --instance-ids "$instance_id" --query "Reservations[0].Instances[0].State.Name" --output text)" != "stopped" ]; do echo -n "."; sleep 1; done; echo " ✅ stopped"


#+end_src

*Result:* EC2 instance is started and ready for use. Stop commands are provided as well.

