private-rag.html
<div id="outline-container-org57998c8" class="outline-5">
<h5 id="org57998c8"><span class="section-number-5">4.6.1.1.</span> Recommendations</h5>
<div class="outline-text-5" id="text-4-6-1-1">
<ul class="org-ul">
<li><b>For most RAG setups</b>: Start with <code>r5.xlarge</code> or <code>r6g.xlarge</code> for a balance of memory, performance, and cost.</li>
<li><b>For high-performance needs</b>: Opt for <code>r7g.xlarge</code> if network speed is critical (e.g., for real-time inference).</li>
<li><b>Scaling up</b>: If 32 GB isn't enough, <code>r5.2xlarge</code> provides 64 GB without overkill.</li>
<li><b>Considerations</b>: R series are optimized for memory-intensive tasks. Use Spot instances for cost savings (~50-70% off on-demand). Monitor with CloudWatch for actual usage. If your workload involves GPUs (e.g., for advanced ML), consider P or G series, but they exceed basic RAG needs and are pricier.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb68e950" class="outline-4">
<h4 id="orgb68e950"><span class="section-number-4">4.6.2.</span> Upgrading to a Larger Instance Type with Terraform</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
The best and fastest way to upgrade your EC2 instance to one with more memory is to update your Terraform configuration and apply the changes. This approach is automated, ensures consistency, and avoids manual errors.
</p>
</div>
<div id="outline-container-org1cbabb8" class="outline-5">
<h5 id="org1cbabb8"><span class="section-number-5">4.6.2.1.</span> Steps to Upgrade</h5>
<div class="outline-text-5" id="text-4-6-2-1">
<ol class="org-ol">
<li><b>Update the Terraform Variables</b>:
<ul class="org-ul">
<li>Edit <code>terraform/terraform.tfvars</code> and change <code>instance_type = "t3.medium"</code> to your desired instance type (e.g., <code>instance_type = "r5.xlarge"</code>).</li>
<li>Alternatively, update the default in <code>terraform/variables.tf</code> if you prefer not to modify <code>tfvars</code>.</li>
</ul></li>

<li><b>Apply the Changes</b>:
<ul class="org-ul">
<li>Navigate to the <code>terraform/</code> directory in your terminal.</li>
<li>Run <code>terraform plan</code> to preview the changes (it will show the instance type update).</li>
<li>Run <code>terraform apply</code> to execute the upgrade. Terraform will:
<ul class="org-ul">
<li>Stop the existing instance.</li>
<li>Change the instance type.</li>
<li>Restart the instance with the new configuration.</li>
</ul></li>
<li>This process typically takes 5-10 minutes, depending on AWS availability.</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgcc85aaa" class="outline-5">
<h5 id="orgcc85aaa"><span class="section-number-5">4.6.2.2.</span> Why This Method Is Best/Fastest</h5>
<div class="outline-text-5" id="text-4-6-2-2">
<ul class="org-ul">
<li><b>Automation</b>: Terraform handles the entire process, ensuring consistency and avoiding manual errors.</li>
<li><b>Minimal Downtime</b>: The stop/change/start cycle is efficient for instance type changes.</li>
<li><b>No Data Loss</b>: Your EBS root volume (50 GB) and Elastic IP remain attached.</li>
<li><b>Cost</b>: Monitor via AWS Cost Explorer. R series instances are reasonably priced.</li>
<li><b>Alternatives Considered</b>:
<ul class="org-ul">
<li>Manual AWS Console change: Faster for one-off updates but not recommended for Terraform-managed infrastructure, as it can cause drift.</li>
<li>Creating a new instance: Slower and requires data migration.</li>
</ul></li>
</ul>

<p>
If you encounter issues (e.g., instance family incompatibility), Terraform will prompt you. Ensure your AWS credentials are configured and the instance is not in use during the upgrade.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Upgrading EC2 instance type with Terraform</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Updating instance configuration and applying changes</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Navigate to the Terraform directory</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update the instance type in terraform.tfvars (replace 'r5.xlarge' with your desired type)</span>
sed -i <span style="color: #008000;">'s/instance_type    = "t3.medium"/instance_type    = "r5.xlarge"/g'</span> terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review the updated configuration</span>
cat terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate and review the deployment plan</span>
terraform plan -out=tfplan -var-file=terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Apply the changes to upgrade the instance</span>
terraform apply tfplan

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the instance has been upgraded</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceType, State.Name]'</span> <span style="color: #008000;">\</span>
  --output text
</pre>
</div>

<p>
<b>Result:</b> EC2 instance type has been successfully upgraded to the new configuration with increased memory capacity.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org756ae21" class="outline-3">
<h3 id="org756ae21"><span class="section-number-3">4.7.</span> Infrastructure Live-Cycle Operations</h3>
<div class="outline-text-3" id="text-4-7">
<p>
This section provides procedures for managing the EC2 instance lifecycle - starting and stopping the instance when returning to work sessions after periods of inactivity.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #0000FF; font-weight: bold;">exit</span>
<span style="color: #006FE0;">pwd</span>


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Initialize project environment</span>
<span style="color: #BA36A5;">PROJECT_DIR</span>=<span style="color: #008000;">"/Users/$(whoami)/LocalProjects/RagFlow/private-rag"</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR"</span>
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">AWS_PROFILE</span>=default

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Get instance ID</span>
<span style="color: #BA36A5;">instance_id</span>=$(aws ec2 describe-instances --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow"</span> --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId]'</span> --output text | head -n1)
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">instance_id</span>

<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">STATUS: Get current instance state</span>
aws ec2 describe-instances --instance-ids <span style="color: #008000;">"$instance_id"</span> --query <span style="color: #008000;">'Reservations[*].Instances[*].[State.Name]'</span> --output text

<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">START:  Start and wait for running state</span>
aws ec2 start-instances --instance-ids <span style="color: #008000;">"$instance_id"</span>
<span style="color: #0000FF; font-weight: bold;">while</span> [ <span style="color: #008000;">"$(aws ec2 describe-instances --instance-ids "$instance_id" --query "Reservations[0].Instances[0].State.Name" --output text)"</span> != <span style="color: #008000;">"running"</span> ]; <span style="color: #0000FF; font-weight: bold;">do </span><span style="color: #006FE0;">echo</span> -n <span style="color: #008000;">"."</span>; sleep 1; <span style="color: #0000FF; font-weight: bold;">done</span>; <span style="color: #006FE0;">echo</span> <span style="color: #008000;">" &#9989; running"</span>


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Get public IP</span>
<span style="color: #BA36A5;">public_ip</span>=$(aws ec2 describe-instances --instance-ids <span style="color: #008000;">"$instance_id"</span> --query <span style="color: #008000;">'Reservations[*].Instances[*].[PublicIpAddress]'</span> --output text)
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Instance running at: $public_ip"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test SSH connection</span>
ssh EC2-RagFlow <span style="color: #008000;">'whoami &amp;&amp; date &amp;&amp; uptime'</span>


<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">STOP: stop  the instance and wait for stopped state</span>
aws ec2 stop-instances --instance-ids <span style="color: #008000;">"$instance_id"</span>
<span style="color: #0000FF; font-weight: bold;">while</span> [ <span style="color: #008000;">"$(aws ec2 describe-instances --instance-ids "$instance_id" --query "Reservations[0].Instances[0].State.Name" --output text)"</span> != <span style="color: #008000;">"stopped"</span> ]; <span style="color: #0000FF; font-weight: bold;">do </span><span style="color: #006FE0;">echo</span> -n <span style="color: #008000;">"."</span>; sleep 1; <span style="color: #0000FF; font-weight: bold;">done</span>; <span style="color: #006FE0;">echo</span> <span style="color: #008000;">" &#9989; stopped"</span>


</pre>
</div>

<p>
<b>Result:</b> EC2 instance is started and ready for use. Stop commands are provided as well.
</p>
</div>
</div>
