private-rag.org
** Summary

Infrastructure automation through Terraform provisions the AWS environment. The EC2 instance operates with proper network security configuration. SSH access is established through dedicated keypairs. The infrastructure exists as version-controlled code, enabling consistent reproduction across deployments.


* Development Environment Setup

** Complete Docker Engine and Tools Installation

This section establishes the complete development environment on the AWS EC2 instance, including Docker Engine, container management tools, GitHub CLI, and Python development utilities. These tools form the foundation for both RagFlow deployment and CI/CD testing.

*** Docker Engine Installation

Install Docker Engine with proper repository configuration and user permissions.

#+begin_src bash
# Listing: Docker Engine installation on EC2
# Setting up containerization platform for applications

ssh EC2-RagFlow
bash
# Remove any old Docker versions that may exist
sudo apt remove docker docker-engine docker.io containerd runc 2>/dev/null || true

# Update system packages
sudo apt update
sudo apt install -y ca-certificates curl gnupg lsb-release

# Add Docker's official GPG key
sudo install -m 0755 -d /etc/apt/keyrings
curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo gpg --dearmor -o /etc/apt/keyrings/docker.gpg
sudo chmod a+r /etc/apt/keyrings/docker.gpg

# Verify GPG key installation
cat /etc/apt/keyrings/docker.gpg | gpg --show-keys

# Add Docker repository
echo \
  "deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.gpg] https://download.docker.com/linux/ubuntu \
  $(lsb_release -cs) stable" | sudo tee /etc/apt/sources.list.d/docker.list > /dev/null

# Install Docker packages
sudo apt update
sudo apt install -y docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin

# Configure Docker to run without sudo (important for CI/CD)
sudo usermod -aG docker $USER

# Apply group changes without logout
newgrp docker

# Test Docker installation
docker run hello-world

# Verify Docker Compose
docker compose version

exit

#+end_src

*Result:* Docker Engine is installed with proper GPG key verification and user permissions configured for passwordless operation.

*** Docker Service Configuration

Enable Docker as a system service for automatic startup and management.

#+begin_src bash
# Listing: Docker service setup
# Configuring Docker for automatic startup and monitoring

ssh EC2-RagFlow

# Enable Docker service to start on boot
sudo systemctl enable docker

# Start Docker service
sudo systemctl start docker

# Verify service status
sudo systemctl status docker  --no-pager

exit

#+end_src

*Result:* Docker service is configured to start automatically on EC2 instance boot.

*** Lazydocker Installation

Install Lazydocker for convenient terminal-based Docker container management.

#+begin_src bash
# Listing: Lazydocker installation
# Installing terminal UI for Docker management

ssh EC2-RagFlow

# Download and install Lazydocker
curl https://raw.githubusercontent.com/jesseduffield/lazydocker/master/scripts/install_update_linux.sh | bash

# Add Lazydocker to PATH
echo 'export PATH="$HOME/.local/bin:$PATH"' >> ~/.bashrc

# Reload bashrc to apply PATH changes
source ~/.bashrc

# Verify installation
lazydocker --version

exit

#+end_src

*Result:* Lazydocker is installed and available in the PATH for terminal-based Docker management.

*** GitHub CLI Installation

Install the GitHub CLI tool for repository and runner management.

#+begin_src bash
# Listing: GitHub CLI installation
# Installing gh command-line tool for GitHub integration

ssh EC2-RagFlow

# Update package list
sudo apt update

# Install dependencies
sudo apt install -y curl unzip

# Add GitHub CLI GPG key
curl -fsSL https://cli.github.com/packages/githubcli-archive-keyring.gpg | sudo dd of=/usr/share/keyrings/githubcli-archive-keyring.gpg
sudo chmod go+r /usr/share/keyrings/githubcli-archive-keyring.gpg

# Add GitHub CLI repository
echo "deb [arch=$(dpkg --print-architecture) signed-by=/usr/share/keyrings/githubcli-archive-keyring.gpg] https://cli.github.com/packages stable main" | sudo tee /etc/apt/sources.list.d/github-cli.list > /dev/null

# Install GitHub CLI
sudo apt update
sudo apt install -y gh

# Verify installation
gh --version

exit

#+end_src

*Result:* GitHub CLI is installed and ready for repository and runner management operations.

