private-rag.html
<div id="outline-container-org2c43af9" class="outline-3">
<h3 id="org2c43af9"><span class="section-number-3">4.8.</span> Summary</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Infrastructure automation through Terraform provisions the AWS environment. The EC2 instance operates with proper network security configuration. SSH access is established through dedicated keypairs. The infrastructure exists as version-controlled code, enabling consistent reproduction across deployments.
</p>
</div>
</div>
</div>
<div id="outline-container-org4c1dbac" class="outline-2">
<h2 id="org4c1dbac"><span class="section-number-2">5.</span> Development Environment Setup</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org05e5b33" class="outline-3">
<h3 id="org05e5b33"><span class="section-number-3">5.1.</span> Complete Docker Engine and Tools Installation</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This section establishes the complete development environment on the AWS EC2 instance, including Docker Engine, container management tools, GitHub CLI, and Python development utilities. These tools form the foundation for both RagFlow deployment and CI/CD testing.
</p>
</div>
<div id="outline-container-orgd960c30" class="outline-4">
<h4 id="orgd960c30"><span class="section-number-4">5.1.1.</span> Docker Engine Installation</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Install Docker Engine with proper repository configuration and user permissions.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Docker Engine installation on EC2</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Setting up containerization platform for applications</span>

ssh EC2-RagFlow
bash
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove any old Docker versions that may exist</span>
sudo apt remove docker docker-engine docker.io containerd runc 2&gt;/dev/null || <span style="color: #006FE0;">true</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update system packages</span>
sudo apt update
sudo apt install -y ca-certificates curl gnupg lsb-release

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add Docker's official GPG key</span>
sudo install -m 0755 -d /etc/apt/keyrings
curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo gpg --dearmor -o /etc/apt/keyrings/docker.gpg
sudo chmod a+r /etc/apt/keyrings/docker.gpg

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify GPG key installation</span>
cat /etc/apt/keyrings/docker.gpg | gpg --show-keys

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add Docker repository</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">\</span>
  <span style="color: #008000;">"deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.gpg] https://download.docker.com/linux/ubuntu \</span>
<span style="color: #008000;">  $(lsb_release -cs) stable"</span> | sudo tee /etc/apt/sources.list.d/docker.list &gt; /dev/null

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install Docker packages</span>
sudo apt update
sudo apt install -y docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Configure Docker to run without sudo (important for CI/CD)</span>
sudo usermod -aG docker $<span style="color: #BA36A5;">USER</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Apply group changes without logout</span>
<span style="color: #006FE0;">newgrp</span> docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test Docker installation</span>
docker run hello-world

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify Docker Compose</span>
docker compose version

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Docker Engine is installed with proper GPG key verification and user permissions configured for passwordless operation.
</p>
</div>
</div>
<div id="outline-container-org09b3d60" class="outline-4">
<h4 id="org09b3d60"><span class="section-number-4">5.1.2.</span> Docker Service Configuration</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Enable Docker as a system service for automatic startup and management.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Docker service setup</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Configuring Docker for automatic startup and monitoring</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Enable Docker service to start on boot</span>
sudo systemctl enable docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Start Docker service</span>
sudo systemctl start docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify service status</span>
sudo systemctl status docker  --no-pager

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Docker service is configured to start automatically on EC2 instance boot.
</p>
</div>
</div>
<div id="outline-container-orga4939b6" class="outline-4">
<h4 id="orga4939b6"><span class="section-number-4">5.1.3.</span> Lazydocker Installation</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Install Lazydocker for convenient terminal-based Docker container management.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Lazydocker installation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing terminal UI for Docker management</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Download and install Lazydocker</span>
curl https://raw.githubusercontent.com/jesseduffield/lazydocker/master/scripts/install_update_linux.sh | bash

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add Lazydocker to PATH</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">'export PATH="$HOME/.local/bin:$PATH"'</span> &gt;&gt; ~/.bashrc

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Reload bashrc to apply PATH changes</span>
<span style="color: #006FE0;">source</span> ~/.bashrc

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify installation</span>
lazydocker --version

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Lazydocker is installed and available in the PATH for terminal-based Docker management.
</p>
</div>
</div>
<div id="outline-container-org935b1b4" class="outline-4">
<h4 id="org935b1b4"><span class="section-number-4">5.1.4.</span> GitHub CLI Installation</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
Install the GitHub CLI tool for repository and runner management.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: GitHub CLI installation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing gh command-line tool for GitHub integration</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update package list</span>
sudo apt update

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install dependencies</span>
sudo apt install -y curl unzip

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add GitHub CLI GPG key</span>
curl -fsSL https://cli.github.com/packages/githubcli-archive-keyring.gpg | sudo dd <span style="color: #BA36A5;">of</span>=/usr/share/keyrings/githubcli-archive-keyring.gpg
sudo chmod go+r /usr/share/keyrings/githubcli-archive-keyring.gpg

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add GitHub CLI repository</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"deb [arch=$(dpkg --print-architecture) signed-by=/usr/share/keyrings/githubcli-archive-keyring.gpg] https://cli.github.com/packages stable main"</span> | sudo tee /etc/apt/sources.list.d/github-cli.list &gt; /dev/null

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install GitHub CLI</span>
sudo apt update
sudo apt install -y gh

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify installation</span>
gh --version

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> GitHub CLI is installed and ready for repository and runner management operations.
</p>
</div>
</div>
