private-rag.org
*** Docker and Docker Compose Verification

Verify all Docker components are properly installed and functional.

#+begin_src bash
# Listing: Docker installation verification
# Confirming all Docker components are operational

ssh EC2-RagFlow

# Check Docker version
docker --version

# Check Docker Compose version (new recommended format)
docker compose version

# Verify Docker daemon is running
docker ps

# List available Docker images
docker images

exit

#+end_src

*Result:* Docker Engine and Docker Compose are verified as fully operational.

*** Python Development Tools Installation

Install uv (fast Python package installer) and development libraries required for Python projects.

#+begin_src bash
# Listing: Python development tools installation
# Installing uv and development dependencies

ssh EC2-RagFlow

# Install uv (fast Python package installer and runner)
curl -LsSf https://astral.sh/uv/install.sh | sh

# Verify uv installation
uv --version
uvx --version

# Install ICU development libraries and build tools
sudo apt-get update
sudo apt-get install -y \
    libicu-dev \
    pkg-config \
    build-essential

# Verify build tools
gcc --version
pkg-config --version

exit

#+end_src

*Result:* Python development tools including uv, ICU libraries, and build essentials are installed and verified.

*** Development Environment Summary

Verify the complete development environment is ready for deployment.

#+begin_src bash
# Listing: Development environment verification
# Confirming all tools are installed and operational

ssh EC2-RagFlow

# Display installed versions
echo "=== Development Environment Status ==="
echo "Docker:"
docker --version
echo ""
echo "Docker Compose:"
docker compose version
echo ""
echo "GitHub CLI:"
gh --version
echo ""
echo "Python Tools:"
uv --version
echo ""
echo "Build Tools:"
gcc --version | head -1
echo ""
echo "System Information:"
uname -a
echo ""
echo "Available Disk Space:"
df -h /

exit

#+end_src

*Result:* Complete development environment is verified and ready for RagFlow deployment and CI/CD operations.

** Summary

The development environment setup establishes necessary tools for containerized application deployment and CI/CD workflows. Docker Engine provides the containerization platform, Lazydocker offers terminal management, GitHub CLI enables repository integration, and Python development tools support application requirements. This foundation enables RagFlow deployment and GitHub Actions runner functionality on the EC2 instance.


* Core RagFlow Deployment
** Basic Ragflow Setup
This section deploys RagFlow on the EC2 instance using Docker Compose following the QuickStart guide.

#+begin_src bash
# Listing: RagFlow deployment on EC2
# Installing and starting RagFlow RAG platform

# SSH into the EC2 instance
ssh EC2-RagFlow

# Clone the RagFlow repository
cd ~; pwd
git clone https://github.com/infiniflow/ragflow.git

# Navigate to the RagFlow directory
cd ~/ragflow/docker

# Start RagFlow using Docker Compose
docker compose up -d

# Verify the deployment
docker ps

# Getting SERVICE_IP
public_ip=$(curl -s http://checkip.amazonaws.com)
echo $public_ip

# RagFlow URL
echo "RagFlow is accessible at: http://$public_ip:80"

# Shutting down RagFlow (optional)
docker compose stop
# Clean up RagFlow (optional)
docker compose down -v # removes volumes as well
cd ~; rm -rf ragflow


exit
#+end_src

*Result:* RagFlow is successfully deployed and running on the EC2 instance.

Url http://18.184.181.110:80
URL https://18.184.181.110


** HTTPS Setup with Self-Signed Certificate

This section provides step-by-step instructions for setting up HTTPS access to RAGFlow using a self-signed SSL certificate. The setup allows the domain to be reachable via IP address over HTTPS, reusing the existing Nginx configuration files with minimal modifications.

**Prerequisites**

- Docker and Docker Compose installed on your server
- Ports 80 and 443 open on your server
- Server's public IP address (replace <SERVER_IP> with your actual IP throughout these instructions)
- Basic knowledge of command-line operations

