private-rag.html
<div id="outline-container-orgf5605ad" class="outline-4">
<h4 id="orgf5605ad"><span class="section-number-4">5.1.5.</span> Docker and Docker Compose Verification</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
Verify all Docker components are properly installed and functional.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Docker installation verification</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Confirming all Docker components are operational</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check Docker version</span>
docker --version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check Docker Compose version (new recommended format)</span>
docker compose version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify Docker daemon is running</span>
docker ps

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List available Docker images</span>
docker images

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Docker Engine and Docker Compose are verified as fully operational.
</p>
</div>
</div>
<div id="outline-container-org2b7cfd2" class="outline-4">
<h4 id="org2b7cfd2"><span class="section-number-4">5.1.6.</span> Python Development Tools Installation</h4>
<div class="outline-text-4" id="text-5-1-6">
<p>
Install uv (fast Python package installer) and development libraries required for Python projects.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Python development tools installation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing uv and development dependencies</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install uv (fast Python package installer and runner)</span>
curl -LsSf https://astral.sh/uv/install.sh | sh

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify uv installation</span>
uv --version
uvx --version

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install ICU development libraries and build tools</span>
sudo apt-get update
sudo apt-get install -y <span style="color: #008000;">\</span>
    libicu-dev <span style="color: #008000;">\</span>
    pkg-config <span style="color: #008000;">\</span>
    build-essential

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify build tools</span>
gcc --version
pkg-config --version

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Python development tools including uv, ICU libraries, and build essentials are installed and verified.
</p>
</div>
</div>
<div id="outline-container-orgaa59a09" class="outline-4">
<h4 id="orgaa59a09"><span class="section-number-4">5.1.7.</span> Development Environment Summary</h4>
<div class="outline-text-4" id="text-5-1-7">
<p>
Verify the complete development environment is ready for deployment.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Development environment verification</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Confirming all tools are installed and operational</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display installed versions</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"=== Development Environment Status ==="</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Docker:"</span>
docker --version
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">""</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Docker Compose:"</span>
docker compose version
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">""</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"GitHub CLI:"</span>
gh --version
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">""</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Python Tools:"</span>
uv --version
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">""</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Build Tools:"</span>
gcc --version | head -1
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">""</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"System Information:"</span>
uname -a
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">""</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Available Disk Space:"</span>
df -h /

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Complete development environment is verified and ready for RagFlow deployment and CI/CD operations.
</p>
</div>
</div>
</div>
<div id="outline-container-org07dd68c" class="outline-3">
<h3 id="org07dd68c"><span class="section-number-3">5.2.</span> Summary</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The development environment setup establishes necessary tools for containerized application deployment and CI/CD workflows. Docker Engine provides the containerization platform, Lazydocker offers terminal management, GitHub CLI enables repository integration, and Python development tools support application requirements. This foundation enables RagFlow deployment and GitHub Actions runner functionality on the EC2 instance.
</p>
</div>
</div>
</div>
<div id="outline-container-org49ea314" class="outline-2">
<h2 id="org49ea314"><span class="section-number-2">6.</span> Core RagFlow Deployment</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgcda4269" class="outline-3">
<h3 id="orgcda4269"><span class="section-number-3">6.1.</span> Basic Ragflow Setup</h3>
<div class="outline-text-3" id="text-6-1">
<p>
This section deploys RagFlow on the EC2 instance using Docker Compose following the QuickStart guide.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: RagFlow deployment on EC2</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing and starting RagFlow RAG platform</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">SSH into the EC2 instance</span>
ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Clone the RagFlow repository</span>
<span style="color: #006FE0;">cd</span> ~; <span style="color: #006FE0;">pwd</span>
git clone https://github.com/infiniflow/ragflow.git

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Navigate to the RagFlow directory</span>
<span style="color: #006FE0;">cd</span> ~/ragflow/docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Start RagFlow using Docker Compose</span>
docker compose up -d

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the deployment</span>
docker ps

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Getting SERVICE_IP</span>
<span style="color: #BA36A5;">public_ip</span>=$(curl -s http://checkip.amazonaws.com)
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">public_ip</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">RagFlow URL</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"RagFlow is accessible at: http://$public_ip:80"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Shutting down RagFlow (optional)</span>
docker compose stop
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Clean up RagFlow (optional)</span>
docker compose down -v <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">removes volumes as well</span>
<span style="color: #006FE0;">cd</span> ~; rm -rf ragflow


<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> RagFlow is successfully deployed and running on the EC2 instance.
</p>

<p>
Url <a href="http://18.184.181.110">http://18.184.181.110</a>
URL <a href="https://18.184.181.110">https://18.184.181.110</a>
</p>
</div>
</div>
<div id="outline-container-org5b3acbc" class="outline-3">
<h3 id="org5b3acbc"><span class="section-number-3">6.2.</span> HTTPS Setup with Self-Signed Certificate</h3>
<div class="outline-text-3" id="text-6-2">
<p>
This section provides step-by-step instructions for setting up HTTPS access to RAGFlow using a self-signed SSL certificate. The setup allows the domain to be reachable via IP address over HTTPS, reusing the existing Nginx configuration files with minimal modifications.
</p>

<p>
<b><b>Prerequisites</b></b>
</p>

<ul class="org-ul">
<li>Docker and Docker Compose installed on your server</li>
<li>Ports 80 and 443 open on your server</li>
<li>Server's public IP address (replace &lt;SERVER<sub>IP</sub>&gt; with your actual IP throughout these instructions)</li>
<li>Basic knowledge of command-line operations</li>
</ul>
</div>
