private-rag.html
<div id="outline-container-orgd6548be" class="outline-4">
<h4 id="orgd6548be"><span class="section-number-4">6.2.1.</span> Step 1: Generate Self-Signed SSL Certificate**</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
Generate a self-signed certificate for your server's IP address. This certificate will be used by Nginx for HTTPS connections.
</p>

<div class="org-src-container">
<pre class="src src-bash">bash
<span style="color: #006FE0;">pwd</span>
ssh EC2-RagFlow
<span style="color: #006FE0;">cd</span>
<span style="color: #006FE0;">cd</span> ~/ragflow/docker/nginx

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Retrieve the SERVER_IP</span>
curl -s http://checkip.amazonaws.com
<span style="color: #006FE0;">export</span> <span style="color: #BA36A5;">SERVER_IP</span>=$(curl -s http://checkip.amazonaws.com)
<span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">SERVER_IP</span>


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create a directory for SSL certificates</span>
mkdir -p ssl

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a private key</span>
openssl genrsa -out ssl/privkey.pem 2048

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a certificate signing request (CSR) for your IP</span>
openssl req -new -key ssl/privkey.pem -out ssl/cert.csr -subj <span style="color: #008000;">"/C=US/ST=State/L=City/O=Organization/CN=localhost"</span>
openssl req -new -key ssl/privkey.pem -out ssl/cert.csr -subj <span style="color: #008000;">"/C=US/ST=State/L=City/O=Organization/CN=&lt;$SERVER_IP&gt;"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate the self-signed certificate valid for 365 days</span>
openssl x509 -req -days 365 -in ssl/cert.csr -signkey ssl/privkey.pem -out ssl/fullchain.pem

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set appropriate permissions</span>
chmod 600 ssl/privkey.pem
chmod 644 ssl/fullchain.pem

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the certificate was created</span>
ls -la ssl/
cat ssl/fullchain.pem
cat ssl/privkey.pem
cat ssl/cert.csr


</pre>
</div>

<p>
After running these commands, you should see the certificate files in the ssl directory. The fullchain.pem contains the certificate, and privkey.pem contains the private key.
</p>
</div>
</div>
<div id="outline-container-orgce51373" class="outline-4">
<h4 id="orgce51373"><span class="section-number-4">6.2.2.</span> Step 2: Modify Nginx Configuration**</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
Update the existing ragflow.https.conf file to use your IP address instead of a domain name.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Go to the ragflow project directory</span>
<span style="color: #006FE0;">cd</span> ~/ragflow
<span style="color: #006FE0;">pwd</span>


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Copy the existing HTTPS config as a backup</span>
cp docker/nginx/ragflow.https.conf docker/nginx/ragflow.https.ip.conf


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Edit the configuration file to replace domain with IP and proxy path</span>
sed -i <span style="color: #008000;">"s/your-ragflow-domain.com/localhost/g"</span> docker/nginx/ragflow.https.ip.conf
sed -i <span style="color: #008000;">'s|http://ragflow:|http://ragflow-cpu:|'</span> docker/nginx/ragflow.https.ip.conf
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Only if using GPU version, uncomment the following line</span>
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">sed -i 's|http://ragflow:|http://ragflow-gpu:|' docker/nginx/ragflow.https.ip.conf</span>


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the changes</span>
cat docker/nginx/ragflow.https.ip.conf
</pre>
</div>

<p>
The modified configuration now listens on your IP address for both HTTP (redirecting to HTTPS) and HTTPS connections.
</p>
</div>
</div>
<div id="outline-container-orgc9eac43" class="outline-4">
<h4 id="orgc9eac43"><span class="section-number-4">6.2.3.</span> Step 3: Update Docker Compose Configuration**</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
Modify the docker-compose.yml file to mount the self-signed certificates and use the updated Nginx configuration.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #006FE0;">pwd</span>
<span style="color: #006FE0;">cd</span> ~/ragflow/docker

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add certificate volumes to the ragflow service in docker-compose.yml</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Insert these lines under the existing volumes section for ragflow-cpu and ragflow-gpu services</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For ragflow-cpu service (around line 37-44):</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add after: - ./entrypoint.sh:/ragflow/entrypoint.sh</span>
      - ./nginx/ssl/fullchain.pem:/etc/nginx/ssl/fullchain.pem:ro
      - ./nginx/ssl/privkey.pem:/etc/nginx/ssl/privkey.pem:ro
      - ./nginx/ragflow.https.ip.conf:/etc/nginx/conf.d/ragflow.confls


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For ragflow-gpu service (around line 86-93):</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add after: - ./entrypoint.sh:/ragflow/entrypoint.sh</span>
      - ./nginx/ssl/fullchain.pem:/etc/nginx/ssl/fullchain.pem:ro
      - ./nginx/ssl/privkey.pem:/etc/nginx/ssl/privkey.pem:ro
      - ./nginx/ragflow.https.ip.conf:/etc/nginx/conf.d/ragflow.conf

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the docker-compose.yml file syntax</span>
docker compose config
</pre>
</div>

<p>
The docker-compose.yml now mounts your self-signed certificates and the modified Nginx configuration into the container.
</p>
</div>
</div>
<div id="outline-container-org8d23bbc" class="outline-4">
<h4 id="org8d23bbc"><span class="section-number-4">6.2.4.</span> Step 4: Restart RAGFlow Services**</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
Stop the existing services and restart them with the new HTTPS configuration.
</p>

<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #006FE0;">cd</span> ~/ragflow/docker
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Stop all running services</span>
docker compose down

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Start the services (use --profile cpu or gpu as needed)</span>
docker compose --profile cpu up -d

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Wait for services to start</span>
sleep 30

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check that services are running</span>
docker compose ps

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify Nginx is listening on ports 80 and 443</span>
docker compose exec ragflow-cpu netstat -tlnp | grep :80
docker compose exec ragflow-cpu netstat -tlnp | grep :443
</pre>
</div>

<p>
After restarting, RAGFlow should be accessible via HTTPS at <a href="https://&lt;server_ip&gt;">https://&lt;server_ip&gt;</a>. Note that browsers will show a security warning due to the self-signed certificate.
</p>
</div>
</div>
<div id="outline-container-orgbbf6ea1" class="outline-4">
<h4 id="orgbbf6ea1"><span class="section-number-4">6.2.5.</span> Step 5: Test HTTPS Access**</h4>
<div class="outline-text-4" id="text-6-2-5">
<p>
Verify that the HTTPS setup is working correctly.
</p>

<div class="org-src-container">
<pre class="src src-bash">


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test HTTP to HTTPS redirect</span>
curl -I http://$<span style="color: #BA36A5;">SERVER_IP</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test HTTPS connection (ignore certificate warnings)</span>
curl -k -I https://$<span style="color: #BA36A5;">SERVER_IP</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check certificate details</span>
openssl s_client -connect $<span style="color: #BA36A5;">SERVER_IP</span>:443 -servername $<span style="color: #BA36A5;">SERVER_IP</span> &lt; /dev/null 2&gt;/dev/null | openssl x509 -noout -dates -subject

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify RAGFlow API is accessible over HTTPS</span>
curl -k https://$<span style="color: #BA36A5;">SERVER_IP</span>/v1/system/healthz

</pre>
</div>

<p>
The HTTP request should redirect to HTTPS, and the HTTPS connection should succeed despite certificate warnings. The API status endpoint should return a valid response.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcef3740" class="outline-3">
<h3 id="orgcef3740"><span class="section-number-3">6.3.</span> Use Case: Access RagFlow via SSH-Tunnel</h3>
<div class="outline-text-3" id="text-6-3">
<p>
This creates an SSH tunnel to access RagFlow securely from a local browser.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Testing RagFlow via SSH tunnel</span>

ssh -L 9380:localhost:80 EC2-RagFlow
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Open RagFlow in your browser at http://localhost:9380</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
When the SSH tunnel is established, RagFlow can be accessed via local browser at:
<a href="http://localhost:9380">http://localhost:9380</a>
</p>

<p>
<b>Result:</b> RagFlow is accessible via SSH tunnel and ready for document processing and RAG operations.
</p>
</div>
</div>
