private-rag.org
** Summary

RagFlow deployment establishes the core RAG platform. The application configures with Docker containerization, HTTPS setup with self-signed certificates, and SSH tunnel access for secure local browser connectivity. The system integrates document processing and knowledge base management.




* Advanced Features - Document Processing

** Document Ingestion and Processing

This demonstrates uploading and processing documents for RAG functionality.

*** Upload Documents

Access RagFlow via browser and upload sample documents for processing.

*** Configure Knowledge Base

Create a knowledge base and configure document parsing settings.

*** Test RAG Queries

Test retrieval-augmented generation with uploaded documents.

** Summary

Document processing enables advanced knowledge management while preserving privacy. Local processing handles sensitive documents without transmitting data to external services.


* Infrastructure Cleanup

** Cleanup Philosophy

Infrastructure as Code enables rapid deployment, but equally important is the ability to cleanly tear down resources to avoid unnecessary costs. This section provides procedures for complete cleanup of all deployed resources.

** Stop RagFlow Services

Before destroying infrastructure, gracefully stop all running services.

#+begin_src bash
# Listing: Stopping RagFlow services
# Gracefully shutting down all containers

ssh EC2-RagFlow

# Stop RagFlow Docker containers
cd ~/ragflow
docker-compose down

# Verify containers are stopped
docker ps -a

# Optional: Remove Docker images to free disk space
docker system prune -a -f

# Exit SSH session
exit
#+end_src

*Result:* RagFlow services are stopped and Docker containers are removed from the EC2 instance.

** Terminate EC2 Instance with Terraform

Use Terraform to cleanly destroy all AWS infrastructure resources.

#+begin_src bash
# Listing: Destroying AWS infrastructure
# Removing all Terraform-managed resources

cd "$PROJECT_DIR/terraform"

# Review what will be destroyed
terraform plan -destroy -var-file=terraform.tfvars

# Destroy all infrastructure
terraform destroy -var-file=terraform.tfvars
yes

# Verify destruction
terraform show

# List remaining EC2 instances (should show none with EC2-RagFlow tag)
aws ec2 describe-instances \
  --filters "Name=tag:Name,Values=EC2-RagFlow" \
  --query 'Reservations[*].Instances[*].[InstanceId, State.Name]' \
  --output text
#+end_src

*Result:* All AWS infrastructure resources are destroyed, including EC2 instance, security groups, and key pairs.

** Clean Up Local SSH Configuration

Remove SSH configurations and keys associated with the destroyed instance.

#+begin_src bash
# Listing: Removing local SSH configuration
# Cleaning up SSH keys and config entries

# Remove SSH config entry for EC2-RagFlow
# Manual edit recommended to preserve other configurations
echo "Removing SSH config entry for EC2-RagFlow..."
perl -i.bak -ne 'print unless /^Host EC2-RagFlow$/..(/^Host / && !/^Host EC2-RagFlow$/)' ~/.ssh/config

# Verify removal
grep -A 5 "EC2-RagFlow" ~/.ssh/config || echo "SSH config entry removed successfully"

# Optional: Remove SSH keys (only if no longer needed)
# Uncomment the following lines if you want to delete the keys:
# rm -f ~/.ssh/ragflow_key
# rm -f ~/.ssh/ragflow_key.pub

# List remaining SSH keys
ls -la ~/.ssh/ragflow_key* 2>/dev/null || echo "SSH keys still present (not removed)"
#+end_src

*Result:* SSH configuration entries are removed. SSH keys remain available for potential future deployments (remove manually if no longer needed).

** Clean Up Terraform State Files

Clean up Terraform state and temporary files.

#+begin_src bash
# Listing: Cleaning up Terraform files
# Removing state and temporary files

cd "$PROJECT_DIR/terraform"

# List Terraform state files
ls -la terraform.tfstate*

# Optional: Back up state files before removal
mkdir -p ../terraform-backups
cp terraform.tfstate* ../terraform-backups/ 2>/dev/null || echo "No state files to backup"

# Remove Terraform state files (only after infrastructure is destroyed)
rm -f terraform.tfstate
rm -f terraform.tfstate.backup
rm -f tfplan*
rm -f terraform.tfvars

# Clean up Terraform cache
rm -rf .terraform

# Verify cleanup
ls -la
#+end_src

*Result:* Terraform state files and temporary files are removed to complete the cleanup process.

