private-rag.html
<div id="outline-container-org2e26020" class="outline-3">
<h3 id="org2e26020"><span class="section-number-3">6.4.</span> Summary</h3>
<div class="outline-text-3" id="text-6-4">
<p>
RagFlow deployment establishes the core RAG platform. The application configures with Docker containerization, HTTPS setup with self-signed certificates, and SSH tunnel access for secure local browser connectivity. The system integrates document processing and knowledge base management.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbc32003" class="outline-2">
<h2 id="orgbc32003"><span class="section-number-2">7.</span> Advanced Features - Document Processing</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4d99ef0" class="outline-3">
<h3 id="org4d99ef0"><span class="section-number-3">7.1.</span> Document Ingestion and Processing</h3>
<div class="outline-text-3" id="text-7-1">
<p>
This demonstrates uploading and processing documents for RAG functionality.
</p>
</div>
<div id="outline-container-org06c1286" class="outline-4">
<h4 id="org06c1286"><span class="section-number-4">7.1.1.</span> Upload Documents</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Access RagFlow via browser and upload sample documents for processing.
</p>
</div>
</div>
<div id="outline-container-orgd5c94d2" class="outline-4">
<h4 id="orgd5c94d2"><span class="section-number-4">7.1.2.</span> Configure Knowledge Base</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
Create a knowledge base and configure document parsing settings.
</p>
</div>
</div>
<div id="outline-container-org3b3c994" class="outline-4">
<h4 id="org3b3c994"><span class="section-number-4">7.1.3.</span> Test RAG Queries</h4>
<div class="outline-text-4" id="text-7-1-3">
<p>
Test retrieval-augmented generation with uploaded documents.
</p>
</div>
</div>
</div>
<div id="outline-container-org7808701" class="outline-3">
<h3 id="org7808701"><span class="section-number-3">7.2.</span> Summary</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Document processing enables advanced knowledge management while preserving privacy. Local processing handles sensitive documents without transmitting data to external services.
</p>
</div>
</div>
</div>
<div id="outline-container-org5f9d052" class="outline-2">
<h2 id="org5f9d052"><span class="section-number-2">8.</span> Infrastructure Cleanup</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org5877c0a" class="outline-3">
<h3 id="org5877c0a"><span class="section-number-3">8.1.</span> Cleanup Philosophy</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Infrastructure as Code enables rapid deployment, but equally important is the ability to cleanly tear down resources to avoid unnecessary costs. This section provides procedures for complete cleanup of all deployed resources.
</p>
</div>
</div>
<div id="outline-container-org8a52ddb" class="outline-3">
<h3 id="org8a52ddb"><span class="section-number-3">8.2.</span> Stop RagFlow Services</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Before destroying infrastructure, gracefully stop all running services.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Stopping RagFlow services</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Gracefully shutting down all containers</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Stop RagFlow Docker containers</span>
<span style="color: #006FE0;">cd</span> ~/ragflow
docker-compose down

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify containers are stopped</span>
docker ps -a

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Optional: Remove Docker images to free disk space</span>
docker system prune -a -f

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> RagFlow services are stopped and Docker containers are removed from the EC2 instance.
</p>
</div>
</div>
<div id="outline-container-orgbb6eed9" class="outline-3">
<h3 id="orgbb6eed9"><span class="section-number-3">8.3.</span> Terminate EC2 Instance with Terraform</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Use Terraform to cleanly destroy all AWS infrastructure resources.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Destroying AWS infrastructure</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Removing all Terraform-managed resources</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Review what will be destroyed</span>
terraform plan -destroy -var-file=terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Destroy all infrastructure</span>
terraform destroy -var-file=terraform.tfvars
yes

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify destruction</span>
terraform show

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List remaining EC2 instances (should show none with EC2-RagFlow tag)</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:Name,Values=EC2-RagFlow"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId, State.Name]'</span> <span style="color: #008000;">\</span>
  --output text
</pre>
</div>

<p>
<b>Result:</b> All AWS infrastructure resources are destroyed, including EC2 instance, security groups, and key pairs.
</p>
</div>
</div>
<div id="outline-container-orgf56b1cb" class="outline-3">
<h3 id="orgf56b1cb"><span class="section-number-3">8.4.</span> Clean Up Local SSH Configuration</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Remove SSH configurations and keys associated with the destroyed instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Removing local SSH configuration</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Cleaning up SSH keys and config entries</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove SSH config entry for EC2-RagFlow</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Manual edit recommended to preserve other configurations</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Removing SSH config entry for EC2-RagFlow..."</span>
perl -i.bak -ne <span style="color: #008000;">'print unless /^Host EC2-RagFlow$/..(/^Host / &amp;&amp; !/^Host EC2-RagFlow$/)'</span> ~/.ssh/config

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify removal</span>
grep -A 5 <span style="color: #008000;">"EC2-RagFlow"</span> ~/.ssh/config || <span style="color: #006FE0;">echo</span> <span style="color: #008000;">"SSH config entry removed successfully"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Optional: Remove SSH keys (only if no longer needed)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Uncomment the following lines if you want to delete the keys:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">rm -f ~/.ssh/ragflow_key</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">rm -f ~/.ssh/ragflow_key.pub</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List remaining SSH keys</span>
ls -la ~/.ssh/ragflow_key* 2&gt;/dev/null || <span style="color: #006FE0;">echo</span> <span style="color: #008000;">"SSH keys still present (not removed)"</span>
</pre>
</div>

<p>
<b>Result:</b> SSH configuration entries are removed. SSH keys remain available for potential future deployments (remove manually if no longer needed).
</p>
</div>
</div>
<div id="outline-container-org64b1429" class="outline-3">
<h3 id="org64b1429"><span class="section-number-3">8.5.</span> Clean Up Terraform State Files</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Clean up Terraform state and temporary files.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Cleaning up Terraform files</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Removing state and temporary files</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List Terraform state files</span>
ls -la terraform.tfstate*

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Optional: Back up state files before removal</span>
mkdir -p ../terraform-backups
cp terraform.tfstate* ../terraform-backups/ 2&gt;/dev/null || <span style="color: #006FE0;">echo</span> <span style="color: #008000;">"No state files to backup"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove Terraform state files (only after infrastructure is destroyed)</span>
rm -f terraform.tfstate
rm -f terraform.tfstate.backup
rm -f tfplan*
rm -f terraform.tfvars

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Clean up Terraform cache</span>
rm -rf .terraform

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify cleanup</span>
ls -la
</pre>
</div>

<p>
<b>Result:</b> Terraform state files and temporary files are removed to complete the cleanup process.
</p>
</div>
</div>
