private-rag.org
** Verify Complete Cleanup

Perform final verification that all resources have been removed.

#+begin_src bash
# Listing: Final cleanup verification
# Confirming all resources are removed

# Check for any remaining EC2 instances
aws ec2 describe-instances \
  --filters "Name=tag:project,Values=ragflow" \
  --query 'Reservations[*].Instances[*].[InstanceId, State.Name, Tags[?Key==`Name`]|[0].Value]' \
  --output table

# Check for remaining security groups
aws ec2 describe-security-groups \
  --filters "Name=group-name,Values=RagFlowSecurityGroup" \
  --query 'SecurityGroups[*].[GroupId, GroupName]' \
  --output table

# Check for remaining key pairs
aws ec2 describe-key-pairs \
  --filters "Name=key-name,Values=ragflow-key" \
  --query 'KeyPairs[*].[KeyName, KeyFingerprint]' \
  --output table

# Summary
echo "============================================"
echo "Cleanup Verification Complete"
echo "============================================"
echo "If any resources are still listed above,"
echo "they may need manual cleanup via AWS Console"
echo "============================================"
#+end_src

*Result:* Final verification confirms all AWS resources have been properly cleaned up and removed.

** Cost Optimization Notes

Some important considerations for cost management:

- **EC2 Instance**: Charges accrue while the instance is running. Use `terraform destroy` when not actively using the system.
- **EBS Volumes**: Storage costs continue even when instances are stopped. Destroy volumes when not needed.
- **Elastic IPs**: Unused Elastic IPs incur charges. Ensure they're released during infrastructure destruction.
- **Data Transfer**: Outbound data transfer from AWS to the internet incurs costs.

For occasional use, consider stopping the instance rather than destroying it:

#+begin_src bash
# Stop instance without destroying (preserves data but stops compute charges)
aws ec2 stop-instances --instance-ids "$instance_id"

# Start instance when needed again
aws ec2 start-instances --instance-ids "$instance_id"
#+end_src

** Summary

Infrastructure cleanup procedures remove all deployed resources. Terraform destroy commands remove AWS infrastructure, SSH configurations clean from local systems, and verification steps confirm proper resource removal. This prevents unexpected costs after project completion.

This project demonstrates that privacy-focused RAG systems are both technically feasible and practically deployable. Self-hosted solutions provide alternatives to cloud-only AI services.

---

*This completes the RagFlow EC2 deployment using live-scripting methodology. Each code block is executable with F4 in Emacs using `send-line-to-vterm`, or can be copied and pasted into any terminal for the same results.*


* Appendix: GitHub Self-Hosted Runner Setup

** GitHub Runner for CI/CD Testing on AWS

This section establishes a GitHub Self-Hosted Runner on the AWS EC2 instance to enable continuous integration and testing workflows. The runner executes GitHub Actions directly on your infrastructure, providing complete control over the CI/CD environment.

*** Prerequisites and Security Group Configuration

Before installing the GitHub Runner, ensure the necessary ports and dependencies are available on the EC2 instance.

#+begin_src bash
# Listing: Update AWS security group for GitHub Runner
# Adding required ports for GitHub Actions communication
exit
pwd
cd "$PROJECT_DIR/terraform"

# GitHub Runner requires outbound HTTPS (443) and SSH (22) access
# These are typically already open, but verify in your security group
# For immediate access, update via AWS CLI if needed:
aws ec2 authorize-security-group-ingress \
  --group-name RagFlowSecurityGroup \
  --protocol tcp \
  --port 443 \
  --cidr 0.0.0.0/0

  --description "GitHub Actions HTTPS"

# Verify security group rules
aws ec2 describe-security-groups \
  --filters "Name=group-name,Values=RagFlowSecurityGroup" \
  --query 'SecurityGroups[*].IpPermissions[*].[FromPort,ToPort,IpProtocol]' \
  --output table

#+end_src

*Result:* Security group is configured to allow GitHub Runner communication with GitHub servers.

*** GitHub Runner Installation and Configuration

Download and configure the GitHub Self-Hosted Runner on the EC2 instance.

#+begin_src bash
# Listing: GitHub Runner installation and setup
# Installing and configuring self-hosted runner for CI/CD

ssh EC2-RagFlow

# Create runner directory
mkdir -p ~/actions-runner
cd ~/actions-runner
pwd
# Download the latest runner package
# Check https://github.com/actions/runner/releases for the latest version
curl -o actions-runner-linux-x64-2.329.0.tar.gz -L https://github.com/actions/runner/releases/download/v2.329.0/actions-runner-linux-x64-2.329.0.tar.gz
ls -ltr
# Verify the package integrity (optional but recommended)
echo "194f1e1e4bd02f80b7e9633fc546084d8d4e19f3928a324d512ea53430102e1d  actions-runner-linux-x64-2.329.0.tar.gz" | shasum -a 256 -c

# Extract the runner
tar xzf ./actions-runner-linux-x64-2.329.0.tar.gz

# List extracted files
ls -la

exit

#+end_src

*Result:* GitHub Runner package is downloaded and extracted on the EC2 instance.

