private-rag.html
<div id="outline-container-org39e7495" class="outline-3">
<h3 id="org39e7495"><span class="section-number-3">8.6.</span> Verify Complete Cleanup</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Perform final verification that all resources have been removed.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Final cleanup verification</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Confirming all resources are removed</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check for any remaining EC2 instances</span>
aws ec2 describe-instances <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=tag:project,Values=ragflow"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'Reservations[*].Instances[*].[InstanceId, State.Name, Tags[?Key==`Name`]|[0].Value]'</span> <span style="color: #008000;">\</span>
  --output table

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check for remaining security groups</span>
aws ec2 describe-security-groups <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=group-name,Values=RagFlowSecurityGroup"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'SecurityGroups[*].[GroupId, GroupName]'</span> <span style="color: #008000;">\</span>
  --output table

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check for remaining key pairs</span>
aws ec2 describe-key-pairs <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=key-name,Values=ragflow-key"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'KeyPairs[*].[KeyName, KeyFingerprint]'</span> <span style="color: #008000;">\</span>
  --output table

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Summary</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"============================================"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Cleanup Verification Complete"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"============================================"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"If any resources are still listed above,"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"they may need manual cleanup via AWS Console"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"============================================"</span>
</pre>
</div>

<p>
<b>Result:</b> Final verification confirms all AWS resources have been properly cleaned up and removed.
</p>
</div>
</div>
<div id="outline-container-orgec46671" class="outline-3">
<h3 id="orgec46671"><span class="section-number-3">8.7.</span> Cost Optimization Notes</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Some important considerations for cost management:
</p>

<ul class="org-ul">
<li><b><b>EC2 Instance</b></b>: Charges accrue while the instance is running. Use `terraform destroy` when not actively using the system.</li>
<li><b><b>EBS Volumes</b></b>: Storage costs continue even when instances are stopped. Destroy volumes when not needed.</li>
<li><b><b>Elastic IPs</b></b>: Unused Elastic IPs incur charges. Ensure they're released during infrastructure destruction.</li>
<li><b><b>Data Transfer</b></b>: Outbound data transfer from AWS to the internet incurs costs.</li>
</ul>

<p>
For occasional use, consider stopping the instance rather than destroying it:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Stop instance without destroying (preserves data but stops compute charges)</span>
aws ec2 stop-instances --instance-ids <span style="color: #008000;">"$instance_id"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Start instance when needed again</span>
aws ec2 start-instances --instance-ids <span style="color: #008000;">"$instance_id"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf1e757f" class="outline-3">
<h3 id="orgf1e757f"><span class="section-number-3">8.8.</span> Summary</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Infrastructure cleanup procedures remove all deployed resources. Terraform destroy commands remove AWS infrastructure, SSH configurations clean from local systems, and verification steps confirm proper resource removal. This prevents unexpected costs after project completion.
</p>

<p>
This project demonstrates that privacy-focused RAG systems are both technically feasible and practically deployable. Self-hosted solutions provide alternatives to cloud-only AI services.
</p>

<p>
&#x2014;
</p>

<p>
<b>This completes the RagFlow EC2 deployment using live-scripting methodology. Each code block is executable with F4 in Emacs using `send-line-to-vterm`, or can be copied and pasted into any terminal for the same results.</b>
</p>
</div>
</div>
</div>
<div id="outline-container-orgf579939" class="outline-2">
<h2 id="orgf579939"><span class="section-number-2">9.</span> Appendix: GitHub Self-Hosted Runner Setup</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgd20c5f6" class="outline-3">
<h3 id="orgd20c5f6"><span class="section-number-3">9.1.</span> GitHub Runner for CI/CD Testing on AWS</h3>
<div class="outline-text-3" id="text-9-1">
<p>
This section establishes a GitHub Self-Hosted Runner on the AWS EC2 instance to enable continuous integration and testing workflows. The runner executes GitHub Actions directly on your infrastructure, providing complete control over the CI/CD environment.
</p>
</div>
<div id="outline-container-orgd850d03" class="outline-4">
<h4 id="orgd850d03"><span class="section-number-4">9.1.1.</span> Prerequisites and Security Group Configuration</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
Before installing the GitHub Runner, ensure the necessary ports and dependencies are available on the EC2 instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Update AWS security group for GitHub Runner</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Adding required ports for GitHub Actions communication</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
<span style="color: #006FE0;">pwd</span>
<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">GitHub Runner requires outbound HTTPS (443) and SSH (22) access</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">These are typically already open, but verify in your security group</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For immediate access, update via AWS CLI if needed:</span>
aws ec2 authorize-security-group-ingress <span style="color: #008000;">\</span>
  --group-name RagFlowSecurityGroup <span style="color: #008000;">\</span>
  --protocol tcp <span style="color: #008000;">\</span>
  --port 443 <span style="color: #008000;">\</span>
  --cidr 0.0.0.0/0

  --description <span style="color: #008000;">"GitHub Actions HTTPS"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify security group rules</span>
aws ec2 describe-security-groups <span style="color: #008000;">\</span>
  --filters <span style="color: #008000;">"Name=group-name,Values=RagFlowSecurityGroup"</span> <span style="color: #008000;">\</span>
  --query <span style="color: #008000;">'SecurityGroups[*].IpPermissions[*].[FromPort,ToPort,IpProtocol]'</span> <span style="color: #008000;">\</span>
  --output table

</pre>
</div>

<p>
<b>Result:</b> Security group is configured to allow GitHub Runner communication with GitHub servers.
</p>
</div>
</div>
<div id="outline-container-org2d378c0" class="outline-4">
<h4 id="org2d378c0"><span class="section-number-4">9.1.2.</span> GitHub Runner Installation and Configuration</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
Download and configure the GitHub Self-Hosted Runner on the EC2 instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: GitHub Runner installation and setup</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing and configuring self-hosted runner for CI/CD</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create runner directory</span>
mkdir -p ~/actions-runner
<span style="color: #006FE0;">cd</span> ~/actions-runner
<span style="color: #006FE0;">pwd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Download the latest runner package</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check https://github.com/actions/runner/releases for the latest version</span>
curl -o actions-runner-linux-x64-2.329.0.tar.gz -L https://github.com/actions/runner/releases/download/v2.329.0/actions-runner-linux-x64-2.329.0.tar.gz
ls -ltr
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the package integrity (optional but recommended)</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"194f1e1e4bd02f80b7e9633fc546084d8d4e19f3928a324d512ea53430102e1d  actions-runner-linux-x64-2.329.0.tar.gz"</span> | shasum -a 256 -c

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Extract the runner</span>
tar xzf ./actions-runner-linux-x64-2.329.0.tar.gz

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">List extracted files</span>
ls -la

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> GitHub Runner package is downloaded and extracted on the EC2 instance.
</p>
</div>
</div>
