private-rag.org
*** Runner Registration with GitHub

Register the runner with your GitHub repository to enable CI/CD workflows.

#+begin_src bash
# Listing: GitHub Runner registration
# Configuring runner to connect with GitHub repository

ssh EC2-RagFlow

cd ~/actions-runner

# Generate a registration token from GitHub
# Visit: https://github.com/YOUR_USERNAME/YOUR_REPO/settings/actions/runners/new
# Copy the registration token and use it below

# Configure the runner with your repository details
# Replace the token, URL, and labels with your actual values
./config.sh \
    --url https://github.com/andreaswittmann/ragflow \
    --token AFO65PTWT2JONPGSBNUANR3JBOEXO \
    --name ec2-ragflow-runner \
    --labels ragflow-test,self-hosted \
    --runnergroup Default \
    --work _workcd ~/actions-runner


# Verify configuration
./config.sh list

exit

#+end_src

*Result:* GitHub Runner is configured and registered with your GitHub repository.

*** Running the Runner as a Service

Install and start the GitHub Runner as a systemd service for automatic startup and management.

#+begin_src bash
# Listing: Installing GitHub Runner as systemd service
# Setting up automatic runner startup and management

ssh EC2-RagFlow

cd ~/actions-runner

# Install the runner as a service
sudo ./svc.sh install

# Start the runner service
sudo ./svc.sh start

# Check service status
sudo systemctl --no-pager status actions.runner*

# View runner logs
sudo journalctl -u actions.runner* -f

exit

#+end_src

*Result:* GitHub Runner is installed as a systemd service and automatically starts on EC2 instance boot.

*** Verifying Runner Status

Confirm the runner is connected and ready to execute workflows.

#+begin_src bash
# Listing: Verifying GitHub Runner status
# Confirming runner connectivity and readiness

ssh EC2-RagFlow

cd ~/actions-runner

# Check runner status
./config.sh list

# View service status
sudo systemctl status actions.runner*

# Check if runner is listening for jobs
ps aux | grep -i "actions-runner" | grep -v grep

exit

# Verify in GitHub web interface:
# 1. Navigate to: https://github.com/YOUR_USERNAME/YOUR_REPO/settings/actions/runners
# 2. Your runner should appear with status "Idle" (ready for jobs)

#+end_src

*Result:* GitHub Runner is verified as connected and ready to execute CI/CD workflows.

*** Testing the Runner with a Sample Workflow

Create a simple GitHub Actions workflow to test the runner functionality.

#+begin_src bash
# Listing: Creating test workflow for GitHub Runner
# Setting up a sample CI/CD workflow

# On your local machine, in your repository:
mkdir -p .github/workflows

# Create a simple test workflow
cat > .github/workflows/test-runner.yml << 'EOF'
name: Test Self-Hosted Runner

on:
  push:
    branches: [ main, develop ]
  pull_request:
    branches: [ main ]

jobs:
  test:
    runs-on: [self-hosted, ec2, ragflow-ci]
    steps:
      - uses: actions/checkout@v3
      
      - name: Display system information
        run: |
          echo "Runner: ${{ runner.name }}"
          echo "OS: $(uname -s)"
          uname -a
          
      - name: Check Docker
        run: |
          docker --version
          docker ps
          
      - name: Run basic tests
        run: |
          echo "Running tests on self-hosted runner"
          echo "Current directory: $(pwd)"
          ls -la
EOF

# Commit and push the workflow
git add .github/workflows/test-runner.yml
git commit -m "Add test workflow for self-hosted runner"
git push origin main

#+end_src

*Result:* Sample workflow is created and pushed to trigger runner execution.

*** Monitoring and Troubleshooting

Monitor runner activity and resolve common issues.

#+begin_src bash
# Listing: Monitoring and troubleshooting GitHub Runner
# Checking logs and resolving common problems

ssh EC2-RagFlow

# View runner service logs
sudo journalctl -u actions.runner* -n 50 --no-pager

# Check runner process
ps aux | grep -i "actions-runner"

# View runner configuration
cat ~/actions-runner/.runner

# Check disk space (runners need adequate space for job artifacts)
df -h

# Check memory usage
free -h

# If runner is stuck, restart the service
sudo systemctl restart actions.runner*

# View real-time logs
sudo journalctl -u actions.runner* -f
q

exit

#+end_src

*Result:* Runner logs are monitored and common issues are diagnosed.

