private-rag.html
<div id="outline-container-orgabc7213" class="outline-4">
<h4 id="orgabc7213"><span class="section-number-4">9.1.3.</span> Runner Registration with GitHub</h4>
<div class="outline-text-4" id="text-9-1-3">
<p>
Register the runner with your GitHub repository to enable CI/CD workflows.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: GitHub Runner registration</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Configuring runner to connect with GitHub repository</span>

ssh EC2-RagFlow

<span style="color: #006FE0;">cd</span> ~/actions-runner

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate a registration token from GitHub</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Visit: https://github.com/YOUR_USERNAME/YOUR_REPO/settings/actions/runners/new</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Copy the registration token and use it below</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Configure the runner with your repository details</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Replace the token, URL, and labels with your actual values</span>
./config.sh <span style="color: #008000;">\</span>
    --url https://github.com/andreaswittmann/ragflow <span style="color: #008000;">\</span>
    --token AFO65PTWT2JONPGSBNUANR3JBOEXO <span style="color: #008000;">\</span>
    --name ec2-ragflow-runner <span style="color: #008000;">\</span>
    --labels ragflow-test,self-hosted <span style="color: #008000;">\</span>
    --runnergroup Default <span style="color: #008000;">\</span>
    --work _workcd ~/actions-runner


<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify configuration</span>
./config.sh list

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> GitHub Runner is configured and registered with your GitHub repository.
</p>
</div>
</div>
<div id="outline-container-orgef8d2a7" class="outline-4">
<h4 id="orgef8d2a7"><span class="section-number-4">9.1.4.</span> Running the Runner as a Service</h4>
<div class="outline-text-4" id="text-9-1-4">
<p>
Install and start the GitHub Runner as a systemd service for automatic startup and management.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Installing GitHub Runner as systemd service</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Setting up automatic runner startup and management</span>

ssh EC2-RagFlow

<span style="color: #006FE0;">cd</span> ~/actions-runner

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install the runner as a service</span>
sudo ./svc.sh install

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Start the runner service</span>
sudo ./svc.sh start

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check service status</span>
sudo systemctl --no-pager status actions.runner*

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">View runner logs</span>
sudo journalctl -u actions.runner* -f

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> GitHub Runner is installed as a systemd service and automatically starts on EC2 instance boot.
</p>
</div>
</div>
<div id="outline-container-orgef5347d" class="outline-4">
<h4 id="orgef5347d"><span class="section-number-4">9.1.5.</span> Verifying Runner Status</h4>
<div class="outline-text-4" id="text-9-1-5">
<p>
Confirm the runner is connected and ready to execute workflows.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Verifying GitHub Runner status</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Confirming runner connectivity and readiness</span>

ssh EC2-RagFlow

<span style="color: #006FE0;">cd</span> ~/actions-runner

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check runner status</span>
./config.sh list

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">View service status</span>
sudo systemctl status actions.runner*

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check if runner is listening for jobs</span>
ps aux | grep -i <span style="color: #008000;">"actions-runner"</span> | grep -v grep

<span style="color: #0000FF; font-weight: bold;">exit</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify in GitHub web interface:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">1. Navigate to: https://github.com/YOUR_USERNAME/YOUR_REPO/settings/actions/runners</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">2. Your runner should appear with status "Idle" (ready for jobs)</span>

</pre>
</div>

<p>
<b>Result:</b> GitHub Runner is verified as connected and ready to execute CI/CD workflows.
</p>
</div>
</div>
<div id="outline-container-orgee4d825" class="outline-4">
<h4 id="orgee4d825"><span class="section-number-4">9.1.6.</span> Testing the Runner with a Sample Workflow</h4>
<div class="outline-text-4" id="text-9-1-6">
<p>
Create a simple GitHub Actions workflow to test the runner functionality.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Creating test workflow for GitHub Runner</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Setting up a sample CI/CD workflow</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">On your local machine, in your repository:</span>
mkdir -p .github/workflows

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create a simple test workflow</span>
cat &gt; .github/workflows/test-runner.yml &lt;&lt; <span style="color: #008000;">'EOF'</span>
<span style="color: #0000ff; background-color: #EEF5FE;">name: Test Self-Hosted Runner</span>

<span style="color: #0000ff; background-color: #EEF5FE;">on:</span>
<span style="color: #0000ff; background-color: #EEF5FE;">  push:</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    branches: [ main, develop ]</span>
<span style="color: #0000ff; background-color: #EEF5FE;">  pull_request:</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    branches: [ main ]</span>

<span style="color: #0000ff; background-color: #EEF5FE;">jobs:</span>
<span style="color: #0000ff; background-color: #EEF5FE;">  test:</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    runs-on: [self-hosted, ec2, ragflow-ci]</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    steps:</span>
<span style="color: #0000ff; background-color: #EEF5FE;">      - uses: actions/checkout@v3</span>

<span style="color: #0000ff; background-color: #EEF5FE;">      - name: Display system information</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        run: |</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          echo "Runner: ${{ runner.name }}"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          echo "OS: $(uname -s)"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          uname -a</span>

<span style="color: #0000ff; background-color: #EEF5FE;">      - name: Check Docker</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        run: |</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          docker --version</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          docker ps</span>

<span style="color: #0000ff; background-color: #EEF5FE;">      - name: Run basic tests</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        run: |</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          echo "Running tests on self-hosted runner"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          echo "Current directory: $(pwd)"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">          ls -la</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Commit and push the workflow</span>
git add .github/workflows/test-runner.yml
git commit -m <span style="color: #008000;">"Add test workflow for self-hosted runner"</span>
git push origin main

</pre>
</div>

<p>
<b>Result:</b> Sample workflow is created and pushed to trigger runner execution.
</p>
</div>
</div>
<div id="outline-container-org5f07ed2" class="outline-4">
<h4 id="org5f07ed2"><span class="section-number-4">9.1.7.</span> Monitoring and Troubleshooting</h4>
<div class="outline-text-4" id="text-9-1-7">
<p>
Monitor runner activity and resolve common issues.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Monitoring and troubleshooting GitHub Runner</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Checking logs and resolving common problems</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">View runner service logs</span>
sudo journalctl -u actions.runner* -n 50 --no-pager

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check runner process</span>
ps aux | grep -i <span style="color: #008000;">"actions-runner"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">View runner configuration</span>
cat ~/actions-runner/.runner

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check disk space (runners need adequate space for job artifacts)</span>
df -h

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check memory usage</span>
free -h

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">If runner is stuck, restart the service</span>
sudo systemctl restart actions.runner*

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">View real-time logs</span>
sudo journalctl -u actions.runner* -f
q

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> Runner logs are monitored and common issues are diagnosed.
</p>
</div>
</div>
