private-rag.org
*** Removing the Runner (if needed)

Deregister and remove the runner from your GitHub repository.

#+begin_src bash
# Listing: Removing GitHub Runner
# Deregistering runner from GitHub and cleaning up

ssh EC2-RagFlow

cd ~/actions-runner

# Stop the runner service
sudo ./svc.sh stop

# Uninstall the service
sudo ./svc.sh uninstall

# Remove the runner from GitHub (requires token)
./config.sh remove --token YOUR_REMOVAL_TOKEN_HERE

# Clean up the runner directory
cd ~
rm -rf ~/actions-runner

# Verify removal
ls ~/actions-runner 2>/dev/null || echo "Runner directory successfully removed"

exit

#+end_src

*Result:* GitHub Runner is cleanly removed from the EC2 instance and deregistered from GitHub.

** Summary

GitHub Self-Hosted Runner installation enables continuous integration and testing on AWS infrastructure. Docker Engine provides containerization for workflow jobs, and the runner executes GitHub Actions with full control over the environment. This integration supports automated testing, building, and deployment of RagFlow without GitHub-hosted runners.


* Appendix: Remote Desktop Access with RustDesk

** RustDesk Installation and Configuration

RustDesk provides secure remote desktop access to the EC2 instance without requiring complex port forwarding or VPN setup. This section installs and configures RustDesk for remote management and monitoring.

*** Prerequisites and Security Group Updates

Before installing RustDesk, ensure the necessary ports are open in the AWS security group. RustDesk requires TCP ports 21116 (control) and 21117 (data transfer).

#+begin_src bash
# Listing: Update AWS security group for RustDesk
# Adding required ports for remote desktop access

cd "$PROJECT_DIR/terraform"

# Add RustDesk ports to security group (requires Terraform update)
# Note: This would need to be added to main.tf security group rules:
# ingress {
#   from_port   = 21116
#   to_port     = 21116
#   protocol    = "tcp"
#   cidr_blocks = [var.allowed_ip]
#   description = "RustDesk control port"
# }
# ingress {
#   from_port   = 21117
#   to_port     = 21117
#   protocol    = "tcp"
#   cidr_blocks = [var.allowed_ip]
#   description = "RustDesk data transfer port"
# }
# ingress {
#   from_port   = 21117
#   to_port     = 21117
#   protocol    = "udp"
#   cidr_blocks = [var.allowed_ip]
#   description = "RustDesk data transfer port (UDP)"
# }

# For immediate access, update via AWS CLI:
aws ec2 authorize-security-group-ingress \
  --group-name RagFlowSecurityGroup \
  --protocol tcp \
  --port 21116 \
  --cidr 0.0.0.0/0 \
  --description "RustDesk control"

aws ec2 authorize-security-group-ingress \
  --group-name RagFlowSecurityGroup \
  --protocol tcp \
  --port 21117 \
  --cidr 0.0.0.0/0 \
  --description "RustDesk data transfer TCP"

aws ec2 authorize-security-group-ingress \
  --group-name RagFlowSecurityGroup \
  --protocol udp \
  --port 21117 \
  --cidr 0.0.0.0/0 \
  --description "RustDesk data transfer UDP"
#+end_src

*Result:* Security group is updated to allow RustDesk remote desktop connections.

*** RustDesk Installation on EC2 Instance

This installs RustDesk server components and configures the service for remote access.

#+begin_src bash
# Listing: RustDesk installation on EC2
# Installing remote desktop server for management access

ssh EC2-RagFlow

#
echo "ubuntu:ham2burg" | sudo chpasswd

# Update package list and install dependencies
sudo apt update
sudo apt install -y curl wget apt-transport-https

# Download and install RustDesk (latest stable version)
# Check latest version at: https://github.com/rustdesk/rustdesk/releases
wget https://github.com/rustdesk/rustdesk/releases/download/1.2.3/rustdesk-1.2.3-x86_64.deb
sudo dpkg -i rustdesk-1.2.3-x86_64.deb

# Fix any missing dependencies
sudo apt install -f

# Enable and start the RustDesk service
sudo systemctl enable rustdesk
sudo systemctl start rustdesk

# Verify service is running
sudo systemctl status rustdesk

# Check RustDesk configuration
cat ~/.config/rustdesk/RustDesk.toml

exit
#+end_src

*Result:* RustDesk is installed and running on the EC2 instance, ready for remote connections.

