private-rag.html
<div id="outline-container-orgf96d082" class="outline-4">
<h4 id="orgf96d082"><span class="section-number-4">9.1.8.</span> Removing the Runner (if needed)</h4>
<div class="outline-text-4" id="text-9-1-8">
<p>
Deregister and remove the runner from your GitHub repository.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Removing GitHub Runner</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Deregistering runner from GitHub and cleaning up</span>

ssh EC2-RagFlow

<span style="color: #006FE0;">cd</span> ~/actions-runner

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Stop the runner service</span>
sudo ./svc.sh stop

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Uninstall the service</span>
sudo ./svc.sh uninstall

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove the runner from GitHub (requires token)</span>
./config.sh remove --token YOUR_REMOVAL_TOKEN_HERE

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Clean up the runner directory</span>
<span style="color: #006FE0;">cd</span> ~
rm -rf ~/actions-runner

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify removal</span>
ls ~/actions-runner 2&gt;/dev/null || <span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Runner directory successfully removed"</span>

<span style="color: #0000FF; font-weight: bold;">exit</span>

</pre>
</div>

<p>
<b>Result:</b> GitHub Runner is cleanly removed from the EC2 instance and deregistered from GitHub.
</p>
</div>
</div>
</div>
<div id="outline-container-org0e05c45" class="outline-3">
<h3 id="org0e05c45"><span class="section-number-3">9.2.</span> Summary</h3>
<div class="outline-text-3" id="text-9-2">
<p>
GitHub Self-Hosted Runner installation enables continuous integration and testing on AWS infrastructure. Docker Engine provides containerization for workflow jobs, and the runner executes GitHub Actions with full control over the environment. This integration supports automated testing, building, and deployment of RagFlow without GitHub-hosted runners.
</p>
</div>
</div>
</div>
<div id="outline-container-org56b48e2" class="outline-2">
<h2 id="org56b48e2"><span class="section-number-2">10.</span> Appendix: Remote Desktop Access with RustDesk</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgeb9f4e7" class="outline-3">
<h3 id="orgeb9f4e7"><span class="section-number-3">10.1.</span> RustDesk Installation and Configuration</h3>
<div class="outline-text-3" id="text-10-1">
<p>
RustDesk provides secure remote desktop access to the EC2 instance without requiring complex port forwarding or VPN setup. This section installs and configures RustDesk for remote management and monitoring.
</p>
</div>
<div id="outline-container-org7f7a988" class="outline-4">
<h4 id="org7f7a988"><span class="section-number-4">10.1.1.</span> Prerequisites and Security Group Updates</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Before installing RustDesk, ensure the necessary ports are open in the AWS security group. RustDesk requires TCP ports 21116 (control) and 21117 (data transfer).
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Update AWS security group for RustDesk</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Adding required ports for remote desktop access</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add RustDesk ports to security group (requires Terraform update)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Note: This would need to be added to main.tf security group rules:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ingress {</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">from_port   = 21116</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">to_port     = 21116</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">protocol    = "tcp"</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">cidr_blocks = [var.allowed_ip]</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">description = "RustDesk control port"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">}</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ingress {</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">from_port   = 21117</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">to_port     = 21117</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">protocol    = "tcp"</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">cidr_blocks = [var.allowed_ip]</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">description = "RustDesk data transfer port"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">}</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ingress {</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">from_port   = 21117</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">to_port     = 21117</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">protocol    = "udp"</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">cidr_blocks = [var.allowed_ip]</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">description = "RustDesk data transfer port (UDP)"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">}</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For immediate access, update via AWS CLI:</span>
aws ec2 authorize-security-group-ingress <span style="color: #008000;">\</span>
  --group-name RagFlowSecurityGroup <span style="color: #008000;">\</span>
  --protocol tcp <span style="color: #008000;">\</span>
  --port 21116 <span style="color: #008000;">\</span>
  --cidr 0.0.0.0/0 <span style="color: #008000;">\</span>
  --description <span style="color: #008000;">"RustDesk control"</span>

aws ec2 authorize-security-group-ingress <span style="color: #008000;">\</span>
  --group-name RagFlowSecurityGroup <span style="color: #008000;">\</span>
  --protocol tcp <span style="color: #008000;">\</span>
  --port 21117 <span style="color: #008000;">\</span>
  --cidr 0.0.0.0/0 <span style="color: #008000;">\</span>
  --description <span style="color: #008000;">"RustDesk data transfer TCP"</span>

aws ec2 authorize-security-group-ingress <span style="color: #008000;">\</span>
  --group-name RagFlowSecurityGroup <span style="color: #008000;">\</span>
  --protocol udp <span style="color: #008000;">\</span>
  --port 21117 <span style="color: #008000;">\</span>
  --cidr 0.0.0.0/0 <span style="color: #008000;">\</span>
  --description <span style="color: #008000;">"RustDesk data transfer UDP"</span>
</pre>
</div>

<p>
<b>Result:</b> Security group is updated to allow RustDesk remote desktop connections.
</p>
</div>
</div>
<div id="outline-container-org1655a52" class="outline-4">
<h4 id="org1655a52"><span class="section-number-4">10.1.2.</span> RustDesk Installation on EC2 Instance</h4>
<div class="outline-text-4" id="text-10-1-2">
<p>
This installs RustDesk server components and configures the service for remote access.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: RustDesk installation on EC2</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing remote desktop server for management access</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;">#</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"ubuntu:ham2burg"</span> | sudo chpasswd

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update package list and install dependencies</span>
sudo apt update
sudo apt install -y curl wget apt-transport-https

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Download and install RustDesk (latest stable version)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check latest version at: https://github.com/rustdesk/rustdesk/releases</span>
wget https://github.com/rustdesk/rustdesk/releases/download/1.2.3/rustdesk-1.2.3-x86_64.deb
sudo dpkg -i rustdesk-1.2.3-x86_64.deb

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Fix any missing dependencies</span>
sudo apt install -f

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Enable and start the RustDesk service</span>
sudo systemctl enable rustdesk
sudo systemctl start rustdesk

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify service is running</span>
sudo systemctl status rustdesk

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check RustDesk configuration</span>
cat ~/.config/rustdesk/RustDesk.toml

<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> RustDesk is installed and running on the EC2 instance, ready for remote connections.
</p>
</div>
</div>
