private-rag.org
*** RustDesk Client Setup on Local Machine

Configure RustDesk on your MacBook Pro for connecting to the remote instance.

#+begin_src bash
# Listing: Local RustDesk client setup
# Preparing local machine for remote desktop connection

# Download and install RustDesk from https://rustdesk.com/
# For macOS:
curl -L https://github.com/rustdesk/rustdesk/releases/download/1.2.3/rustdesk-1.2.3.dmg -o rustdesk.dmg
hdiutil attach rustdesk.dmg
cp -r /Volumes/RustDesk/RustDesk.app /Applications/
hdiutil detach /Volumes/RustDesk

# Launch RustDesk
open /Applications/RustDesk.app
#+end_src

*Result:* RustDesk client is installed and ready for connection to the remote EC2 instance.

*** Establishing Remote Desktop Connection

Connect to the EC2 instance using RustDesk for graphical remote access.

#+begin_src bash
# Listing: Connecting to EC2 via RustDesk
# Establishing remote desktop session

# On the EC2 instance, get the RustDesk ID:
ssh EC2-RagFlow 'sudo rustdesk --get-id'

# Set a password for security (optional but recommended):
ssh EC2-RagFlow 'sudo rustdesk --password'

# In RustDesk client on Mac:
# 1. Enter the ID shown above (e.g., 55689929)
# 2. Enter the password (if set)
# 3. Enter the public IP: 63.180.133.202
# 4. Click Connect

# For direct connection (bypass relay servers):
ssh EC2-RagFlow 'echo "[options]\ndirect-server = \"true\"" >> ~/.config/rustdesk/RustDesk.toml'

# Note: If you get "Unsupported display server type" error:
# 1. Install a desktop environment: sudo apt install -y xfce4 xfce4-goodies
# 2. Start the display manager: sudo systemctl start lightdm
# 3. Add user to nopasswdlogin group: sudo usermod -aG nopasswdlogin ubuntu
# 4. Set default target to graphical: sudo systemctl set-default graphical.target
# 5. Restart lightdm: sudo systemctl restart lightdm
# 6. Set user password if needed: echo "ubuntu:yourpassword" | sudo chpasswd
# 7. Configure XFCE session: sudo mkdir -p /etc/lightdm/lightdm.conf.d && sudo bash -c "echo -e \"[Seat:*]\nuser-session=xfce\n\" > /etc/lightdm/lightdm.conf.d/50-xfce-session.conf"
# 8. Configure German keyboard: sudo dpkg-reconfigure keyboard-configuration (select German) or sudo sed -i "s/XKBLAYOUT=.*/XKBLAYOUT=\"de\"/g" /etc/default/keyboard
# 9. Increase resolution: Create /etc/X11/xorg.conf.d/10-monitor.conf with 1920x1080 configuration and restart lightdm
# 10. Alternative VNC access: Install x11vnc for higher performance VNC connections on port 5900
#+end_src

*Result:* Remote desktop connection is established, providing full graphical access to the EC2 instance.

** Summary

RustDesk installation enables secure remote desktop access to the EC2 instance. The configuration provides graphical management capabilities with security through password protection and direct connection options. This complements SSH access with visual interface capabilities for system administration and monitoring.

* Appendix: Remote Desktop Access with NoMachine

** NoMachine Installation and Configuration

NoMachine provides high-performance remote desktop access to the EC2 instance with low latency and excellent user experience. This section installs and configures NoMachine server for secure graphical remote management.

*** Prerequisites and Security Group Updates

Before installing NoMachine, ensure the necessary ports are open in the AWS security group. NoMachine requires TCP port 4000 for the main connection and UDP ports 4011-4999 for NX technology data transfer.

#+begin_src bash
# Listing: Update AWS security group for NoMachine
# Adding required ports for remote desktop access

cd "$PROJECT_DIR/terraform"

# Add NoMachine ports to security group (requires Terraform update)
# Note: This would need to be added to main.tf security group rules:
# ingress {
#   from_port   = 4000
#   to_port     = 4000
#   protocol    = "tcp"
#   cidr_blocks = [var.allowed_ip]
#   description = "NoMachine main connection port"
# }
# ingress {
#   from_port   = 4011
#   to_port     = 4999
#   protocol    = "udp"
#   cidr_blocks = [var.allowed_ip]
#   description = "NoMachine NX data transfer ports"
# }

# For immediate access, update via AWS CLI:
aws ec2 authorize-security-group-ingress \
  --group-name RagFlowSecurityGroup \
  --protocol tcp \
  --port 4000 \
  --cidr 0.0.0.0/0 \
  --description "NoMachine main connection"

aws ec2 authorize-security-group-ingress \
  --group-name RagFlowSecurityGroup \
  --protocol udp \
  --port 4011-4999 \
  --cidr 0.0.0.0/0 \
  --description "NoMachine NX data transfer"
#+end_src

*Result:* Security group is updated to allow NoMachine remote desktop connections.

