private-rag.html
<div id="outline-container-orge338b16" class="outline-4">
<h4 id="orge338b16"><span class="section-number-4">10.1.3.</span> RustDesk Client Setup on Local Machine</h4>
<div class="outline-text-4" id="text-10-1-3">
<p>
Configure RustDesk on your MacBook Pro for connecting to the remote instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Local RustDesk client setup</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Preparing local machine for remote desktop connection</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Download and install RustDesk from https://rustdesk.com/</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For macOS:</span>
curl -L https://github.com/rustdesk/rustdesk/releases/download/1.2.3/rustdesk-1.2.3.dmg -o rustdesk.dmg
hdiutil attach rustdesk.dmg
cp -r /Volumes/RustDesk/RustDesk.app /Applications/
hdiutil detach /Volumes/RustDesk

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Launch RustDesk</span>
open /Applications/RustDesk.app
</pre>
</div>

<p>
<b>Result:</b> RustDesk client is installed and ready for connection to the remote EC2 instance.
</p>
</div>
</div>
<div id="outline-container-orgceb07b4" class="outline-4">
<h4 id="orgceb07b4"><span class="section-number-4">10.1.4.</span> Establishing Remote Desktop Connection</h4>
<div class="outline-text-4" id="text-10-1-4">
<p>
Connect to the EC2 instance using RustDesk for graphical remote access.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Connecting to EC2 via RustDesk</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Establishing remote desktop session</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">On the EC2 instance, get the RustDesk ID:</span>
ssh EC2-RagFlow <span style="color: #008000;">'sudo rustdesk --get-id'</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set a password for security (optional but recommended):</span>
ssh EC2-RagFlow <span style="color: #008000;">'sudo rustdesk --password'</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">In RustDesk client on Mac:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">1. Enter the ID shown above (e.g., 55689929)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">2. Enter the password (if set)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">3. Enter the public IP: 63.180.133.202</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">4. Click Connect</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For direct connection (bypass relay servers):</span>
ssh EC2-RagFlow <span style="color: #008000;">'echo "[options]\ndirect-server = \"true\"" &gt;&gt; ~/.config/rustdesk/RustDesk.toml'</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Note: If you get "Unsupported display server type" error:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">1. Install a desktop environment: sudo apt install -y xfce4 xfce4-goodies</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">2. Start the display manager: sudo systemctl start lightdm</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">3. Add user to nopasswdlogin group: sudo usermod -aG nopasswdlogin ubuntu</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">4. Set default target to graphical: sudo systemctl set-default graphical.target</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">5. Restart lightdm: sudo systemctl restart lightdm</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">6. Set user password if needed: echo "ubuntu:yourpassword" | sudo chpasswd</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">7. Configure XFCE session: sudo mkdir -p /etc/lightdm/lightdm.conf.d &amp;&amp; sudo bash -c "echo -e \"[Seat:*]\nuser-session=xfce\n\" &gt; /etc/lightdm/lightdm.conf.d/50-xfce-session.conf"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">8. Configure German keyboard: sudo dpkg-reconfigure keyboard-configuration (select German) or sudo sed -i "s/XKBLAYOUT=.*/XKBLAYOUT=\"de\"/g" /etc/default/keyboard</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">9. Increase resolution: Create /etc/X11/xorg.conf.d/10-monitor.conf with 1920x1080 configuration and restart lightdm</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">10. Alternative VNC access: Install x11vnc for higher performance VNC connections on port 5900</span>
</pre>
</div>

<p>
<b>Result:</b> Remote desktop connection is established, providing full graphical access to the EC2 instance.
</p>
</div>
</div>
</div>
<div id="outline-container-org97559a6" class="outline-3">
<h3 id="org97559a6"><span class="section-number-3">10.2.</span> Summary</h3>
<div class="outline-text-3" id="text-10-2">
<p>
RustDesk installation enables secure remote desktop access to the EC2 instance. The configuration provides graphical management capabilities with security through password protection and direct connection options. This complements SSH access with visual interface capabilities for system administration and monitoring.
</p>
</div>
</div>
</div>
<div id="outline-container-org92d6844" class="outline-2">
<h2 id="org92d6844"><span class="section-number-2">11.</span> Appendix: Remote Desktop Access with NoMachine</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org701c4ca" class="outline-3">
<h3 id="org701c4ca"><span class="section-number-3">11.1.</span> NoMachine Installation and Configuration</h3>
<div class="outline-text-3" id="text-11-1">
<p>
NoMachine provides high-performance remote desktop access to the EC2 instance with low latency and excellent user experience. This section installs and configures NoMachine server for secure graphical remote management.
</p>
</div>
<div id="outline-container-org181d3d5" class="outline-4">
<h4 id="org181d3d5"><span class="section-number-4">11.1.1.</span> Prerequisites and Security Group Updates</h4>
<div class="outline-text-4" id="text-11-1-1">
<p>
Before installing NoMachine, ensure the necessary ports are open in the AWS security group. NoMachine requires TCP port 4000 for the main connection and UDP ports 4011-4999 for NX technology data transfer.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Update AWS security group for NoMachine</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Adding required ports for remote desktop access</span>

<span style="color: #006FE0;">cd</span> <span style="color: #008000;">"$PROJECT_DIR/terraform"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add NoMachine ports to security group (requires Terraform update)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Note: This would need to be added to main.tf security group rules:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ingress {</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">from_port   = 4000</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">to_port     = 4000</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">protocol    = "tcp"</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">cidr_blocks = [var.allowed_ip]</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">description = "NoMachine main connection port"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">}</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ingress {</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">from_port   = 4011</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">to_port     = 4999</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">protocol    = "udp"</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">cidr_blocks = [var.allowed_ip]</span>
<span style="color: #8D8D84;">#   </span><span style="color: #8D8D84; font-style: italic;">description = "NoMachine NX data transfer ports"</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">}</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">For immediate access, update via AWS CLI:</span>
aws ec2 authorize-security-group-ingress <span style="color: #008000;">\</span>
  --group-name RagFlowSecurityGroup <span style="color: #008000;">\</span>
  --protocol tcp <span style="color: #008000;">\</span>
  --port 4000 <span style="color: #008000;">\</span>
  --cidr 0.0.0.0/0 <span style="color: #008000;">\</span>
  --description <span style="color: #008000;">"NoMachine main connection"</span>

aws ec2 authorize-security-group-ingress <span style="color: #008000;">\</span>
  --group-name RagFlowSecurityGroup <span style="color: #008000;">\</span>
  --protocol udp <span style="color: #008000;">\</span>
  --port 4011-4999 <span style="color: #008000;">\</span>
  --cidr 0.0.0.0/0 <span style="color: #008000;">\</span>
  --description <span style="color: #008000;">"NoMachine NX data transfer"</span>
</pre>
</div>

<p>
<b>Result:</b> Security group is updated to allow NoMachine remote desktop connections.
</p>
</div>
</div>
