private-rag.org
*** Desktop Environment Installation

Install a lightweight desktop environment if the instance is headless (no graphical interface).

#+begin_src bash
# Listing: Desktop environment installation for NoMachine
# Installing XFCE desktop environment for graphical access

ssh EC2-RagFlow

# Update package list
sudo apt update && sudo apt upgrade -y

# Install XFCE desktop environment
sudo apt install -y xfce4 xfce4-goodies

# Exit SSH session
exit
#+end_src

*Result:* XFCE desktop environment is installed, providing a graphical interface for NoMachine connections.

*** NoMachine Server Installation

Download and install the NoMachine server package on the EC2 instance.

#+begin_src bash
# Listing: NoMachine server installation
# Installing NoMachine server for remote desktop access

ssh EC2-RagFlow

# Download NoMachine server package
wget https://download.nomachine.com/download/8.14/Linux/nomachine_8.14.2_1_amd64.deb

# Install the package
sudo apt install -y ./nomachine_8.14.2_1_amd64.deb

# The service starts automatically after installation
# Verify service status
sudo systemctl status nxserver

# Exit SSH session
exit
#+end_src

*Result:* NoMachine server is installed and running, ready to accept remote desktop connections.

*** Firewall Configuration on Server

Configure UFW firewall to allow NoMachine connections if UFW is active.

#+begin_src bash
# Listing: Firewall configuration for NoMachine
# Allowing NoMachine ports through UFW firewall

ssh EC2-RagFlow

# Allow NoMachine main connection port
sudo ufw allow from 0.0.0.0/0 to any port 4000 proto tcp

# Allow NoMachine NX data transfer ports
sudo ufw allow from 0.0.0.0/0 to any port 4011:4999 proto udp

# Reload firewall rules
sudo ufw reload

# Verify firewall status
sudo ufw status

# Exit SSH session

### if system does not work correctly
ssh EC2-RagFlow 'sudo /etc/NX/nxserver --restart'
exit
#+end_src

*Result:* Firewall is configured to allow NoMachine connections on the required ports.

*** Testing NoMachine Connection

Connect to the EC2 instance using NoMachine client from your local machine.

#+begin_src bash
# Listing: Testing NoMachine connection
# Establishing remote desktop connection

# In NoMachine client:
# 1. Create new connection
# 2. Host: <EC2_PUBLIC_IP>
# 3. Port: 4000
# 4. Protocol: NX
# 5. Authentication: Password (use ubuntu username and instance password)
# 6. Connect

# Display connection details
echo "Connect to NoMachine at: $public_ip:4000"
echo "Username: ubuntu"
echo "Use the SSH key or instance password for authentication"
#+end_src

*Result:* NoMachine connection is established, providing full graphical remote desktop access to the EC2 instance.

*** Troubleshooting Common Issues

Address common NoMachine connection problems.

#+begin_src bash
# Listing: Troubleshooting NoMachine issues
# Resolving common connection problems

ssh EC2-RagFlow

# If connection times out:
# Restart NoMachine service
sudo /etc/NX/nxserver --restart

# If black screen appears:
# Switch from Wayland to X11
sudo nano /etc/gdm3/custom.conf
# Add or uncomment: WaylandEnable=false
# Save and exit, then reboot
sudo reboot

# If connection hangs:
# In client, press Ctrl+Alt+0 to disable hardware decoding

# Exit SSH session
exit
#+end_src

*Result:* Common NoMachine issues are resolved, ensuring stable remote desktop connections.

