private-rag.html
<div id="outline-container-org9392c6a" class="outline-4">
<h4 id="org9392c6a"><span class="section-number-4">11.1.2.</span> Desktop Environment Installation</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
Install a lightweight desktop environment if the instance is headless (no graphical interface).
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Desktop environment installation for NoMachine</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing XFCE desktop environment for graphical access</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update package list</span>
sudo apt update &amp;&amp; sudo apt upgrade -y

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install XFCE desktop environment</span>
sudo apt install -y xfce4 xfce4-goodies

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> XFCE desktop environment is installed, providing a graphical interface for NoMachine connections.
</p>
</div>
</div>
<div id="outline-container-org21dd3e6" class="outline-4">
<h4 id="org21dd3e6"><span class="section-number-4">11.1.3.</span> NoMachine Server Installation</h4>
<div class="outline-text-4" id="text-11-1-3">
<p>
Download and install the NoMachine server package on the EC2 instance.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: NoMachine server installation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing NoMachine server for remote desktop access</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Download NoMachine server package</span>
wget https://download.nomachine.com/download/8.14/Linux/nomachine_8.14.2_1_amd64.deb

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install the package</span>
sudo apt install -y ./nomachine_8.14.2_1_amd64.deb

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">The service starts automatically after installation</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify service status</span>
sudo systemctl status nxserver

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> NoMachine server is installed and running, ready to accept remote desktop connections.
</p>
</div>
</div>
<div id="outline-container-org68350ba" class="outline-4">
<h4 id="org68350ba"><span class="section-number-4">11.1.4.</span> Firewall Configuration on Server</h4>
<div class="outline-text-4" id="text-11-1-4">
<p>
Configure UFW firewall to allow NoMachine connections if UFW is active.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Firewall configuration for NoMachine</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Allowing NoMachine ports through UFW firewall</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Allow NoMachine main connection port</span>
sudo ufw allow from 0.0.0.0/0 to any port 4000 proto tcp

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Allow NoMachine NX data transfer ports</span>
sudo ufw allow from 0.0.0.0/0 to any port 4011:4999 proto udp

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Reload firewall rules</span>
sudo ufw reload

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify firewall status</span>
sudo ufw status

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>

<span style="color: #8D8D84;">### </span><span style="color: #8D8D84; font-style: italic;">if system does not work correctly</span>
ssh EC2-RagFlow <span style="color: #008000;">'sudo /etc/NX/nxserver --restart'</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Firewall is configured to allow NoMachine connections on the required ports.
</p>
</div>
</div>
<div id="outline-container-orga9e5526" class="outline-4">
<h4 id="orga9e5526"><span class="section-number-4">11.1.5.</span> Testing NoMachine Connection</h4>
<div class="outline-text-4" id="text-11-1-5">
<p>
Connect to the EC2 instance using NoMachine client from your local machine.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Testing NoMachine connection</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Establishing remote desktop connection</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">In NoMachine client:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">1. Create new connection</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">2. Host: &lt;EC2_PUBLIC_IP&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">3. Port: 4000</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">4. Protocol: NX</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">5. Authentication: Password (use ubuntu username and instance password)</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">6. Connect</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display connection details</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Connect to NoMachine at: $public_ip:4000"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Username: ubuntu"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Use the SSH key or instance password for authentication"</span>
</pre>
</div>

<p>
<b>Result:</b> NoMachine connection is established, providing full graphical remote desktop access to the EC2 instance.
</p>
</div>
</div>
<div id="outline-container-orgac68aa5" class="outline-4">
<h4 id="orgac68aa5"><span class="section-number-4">11.1.6.</span> Troubleshooting Common Issues</h4>
<div class="outline-text-4" id="text-11-1-6">
<p>
Address common NoMachine connection problems.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Troubleshooting NoMachine issues</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Resolving common connection problems</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">If connection times out:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Restart NoMachine service</span>
sudo /etc/NX/nxserver --restart

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">If black screen appears:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Switch from Wayland to X11</span>
sudo nano /etc/gdm3/custom.conf
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add or uncomment: WaylandEnable=false</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Save and exit, then reboot</span>
sudo reboot

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">If connection hangs:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">In client, press Ctrl+Alt+0 to disable hardware decoding</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Common NoMachine issues are resolved, ensuring stable remote desktop connections.
</p>
</div>
</div>
