private-rag.org
*** High Resolution Configuration with XDummy Driver

For optimal NoMachine performance with higher resolutions, configure the XDummy driver to support resolutions up to 1920x1080 and beyond. This creates a virtual display that NoMachine can connect to with full resolution control.

#+begin_src bash
# Listing: XDummy driver installation for high resolution
# Installing virtual display driver for NoMachine resolution support

ssh EC2-RagFlow

# Install the XDummy driver
sudo apt install -y xserver-xorg-video-dummy

# Exit SSH session
exit
#+end_src

*Result:* XDummy driver is installed, providing virtual display capabilities for higher resolutions.

#+begin_src bash
# Listing: Xorg configuration for high resolution display
# Creating Xorg configuration with multiple resolution support

ssh EC2-RagFlow

# Remove any existing monitor configuration
sudo rm -f /etc/X11/xorg.conf.d/10-monitor.conf

# Create comprehensive Xorg configuration
sudo tee /etc/X11/xorg.conf > /dev/null << 'EOF'
Section "Device"
    Identifier "DummyDevice"
    Driver "dummy"
    Option "UseEDID" "false"
    VideoRam 512000
EndSection

Section "Monitor"
    Identifier "DummyMonitor"
    HorizSync 5.0 - 1000.0
    VertRefresh 5.0 - 200.0
    Option "ReducedBlanking"
    ModeLine "1920x1080" 148.5 1920 2008 2052 2200 1080 1084 1089 1125 +hsync +vsync
    ModeLine "1680x1050" 119.0 1680 1728 1760 1840 1050 1053 1059 1080 +hsync -vsync
    ModeLine "1600x900" 97.5 1600 1648 1680 1760 900 903 908 926 +hsync -vsync
    ModeLine "1440x900" 88.8 1440 1488 1520 1600 900 903 909 926 +hsync -vsync
    ModeLine "1366x768" 72.3 1366 1414 1446 1494 768 771 777 803 +hsync +vsync
    ModeLine "1280x1024" 109.0 1280 1368 1496 1712 1024 1027 1034 1063 -hsync +vsync
    ModeLine "1280x800" 71.0 1280 1328 1360 1440 800 803 809 823 +hsync -vsync
    ModeLine "1024x768" 65.0 1024 1048 1184 1344 768 771 777 806 -hsync -vsync
EndSection

Section "Screen"
    Identifier "DummyScreen"
    Device "DummyDevice"
    Monitor "DummyMonitor"
    DefaultDepth 24
    SubSection "Display"
        Viewport 0 0
        Depth 24
        Modes "1920x1080" "1680x1050" "1600x900" "1440x900" "1366x768" "1280x1024" "1280x800" "1024x768" "800x600"
        Virtual 1920 1080
    EndSubSection
EndSection
EOF

# Exit SSH session
exit
#+end_src

*Result:* Xorg configuration is created with comprehensive resolution support including 1920x1080.

#+begin_src bash
# Listing: Restarting display services for resolution changes
# Applying the new display configuration

ssh EC2-RagFlow

# Restart LightDM to apply Xorg changes
sudo systemctl restart lightdm

# Wait for services to start
sleep 10

# Restart NoMachine server
sudo /etc/NX/nxserver --restart

# Exit SSH session
exit
#+end_src

*Result:* Display services are restarted with the new high-resolution configuration applied.

#+begin_src bash
# Listing: Verifying high resolution configuration
# Checking that the display supports higher resolutions

ssh EC2-RagFlow

# Check Xorg log for dummy driver confirmation
sudo grep -i "dummy\|1920x1080\|modes" /var/log/Xorg.0.log | tail -10

# Exit SSH session
exit

# Test connection with higher resolution
echo "Reconnect with NoMachine - you should now see resolutions up to 1920x1080 available"
echo "In NoMachine client: Connection Settings → Display → Select desired resolution"
#+end_src

*Result:* High resolution configuration is verified and ready for NoMachine connections with full resolution support.
*** German Keyboard Configuration Fix

For users with German keyboards, the NoMachine GUI may default to English keyboard layout even when SSH connections work correctly. This occurs because XFCE desktop settings use an incorrect keyboard model that prevents proper key mapping.

**** Problem Diagnosis

The issue manifests as:
- SSH terminal connections recognize German keyboard correctly
- NoMachine GUI session only offers English keyboard layouts
- Keys produce wrong characters (e.g., 'z' and 'y' swapped, special characters missing)

Root cause: XFCE keyboard model set to "genius" instead of "pc105" (standard PC keyboard).

#+begin_src bash
# Listing: Diagnosing keyboard configuration issue
# Checking current keyboard settings in NoMachine session

ssh EC2-RagFlow

# Check system-level keyboard configuration
localectl status

# Check XFCE keyboard configuration
cat ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml

# Display current keyboard configuration in X11
# Note: This command only works from within an active X session
# Run this in a terminal inside NoMachine: setxkbmap -query

exit
#+end_src

*Result:* Diagnosis reveals incorrect keyboard model ("genius" instead of "pc105") in XFCE configuration.

