private-rag.html
<div id="outline-container-org0e502f5" class="outline-4">
<h4 id="org0e502f5"><span class="section-number-4">11.1.7.</span> High Resolution Configuration with XDummy Driver</h4>
<div class="outline-text-4" id="text-11-1-7">
<p>
For optimal NoMachine performance with higher resolutions, configure the XDummy driver to support resolutions up to 1920x1080 and beyond. This creates a virtual display that NoMachine can connect to with full resolution control.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: XDummy driver installation for high resolution</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Installing virtual display driver for NoMachine resolution support</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Install the XDummy driver</span>
sudo apt install -y xserver-xorg-video-dummy

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> XDummy driver is installed, providing virtual display capabilities for higher resolutions.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Xorg configuration for high resolution display</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Creating Xorg configuration with multiple resolution support</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Remove any existing monitor configuration</span>
sudo rm -f /etc/X11/xorg.conf.d/10-monitor.conf

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create comprehensive Xorg configuration</span>
sudo tee /etc/X11/xorg.conf &gt; /dev/null &lt;&lt; <span style="color: #008000;">'EOF'</span>
<span style="color: #0000ff; background-color: #EEF5FE;">Section "Device"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Identifier "DummyDevice"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Driver "dummy"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Option "UseEDID" "false"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    VideoRam 512000</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EndSection</span>

<span style="color: #0000ff; background-color: #EEF5FE;">Section "Monitor"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Identifier "DummyMonitor"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    HorizSync 5.0 - 1000.0</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    VertRefresh 5.0 - 200.0</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Option "ReducedBlanking"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1920x1080" 148.5 1920 2008 2052 2200 1080 1084 1089 1125 +hsync +vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1680x1050" 119.0 1680 1728 1760 1840 1050 1053 1059 1080 +hsync -vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1600x900" 97.5 1600 1648 1680 1760 900 903 908 926 +hsync -vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1440x900" 88.8 1440 1488 1520 1600 900 903 909 926 +hsync -vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1366x768" 72.3 1366 1414 1446 1494 768 771 777 803 +hsync +vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1280x1024" 109.0 1280 1368 1496 1712 1024 1027 1034 1063 -hsync +vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1280x800" 71.0 1280 1328 1360 1440 800 803 809 823 +hsync -vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    ModeLine "1024x768" 65.0 1024 1048 1184 1344 768 771 777 806 -hsync -vsync</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EndSection</span>

<span style="color: #0000ff; background-color: #EEF5FE;">Section "Screen"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Identifier "DummyScreen"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Device "DummyDevice"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    Monitor "DummyMonitor"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    DefaultDepth 24</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    SubSection "Display"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        Viewport 0 0</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        Depth 24</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        Modes "1920x1080" "1680x1050" "1600x900" "1440x900" "1366x768" "1280x1024" "1280x800" "1024x768" "800x600"</span>
<span style="color: #0000ff; background-color: #EEF5FE;">        Virtual 1920 1080</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    EndSubSection</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EndSection</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Xorg configuration is created with comprehensive resolution support including 1920x1080.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Restarting display services for resolution changes</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Applying the new display configuration</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Restart LightDM to apply Xorg changes</span>
sudo systemctl restart lightdm

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Wait for services to start</span>
sleep 10

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Restart NoMachine server</span>
sudo /etc/NX/nxserver --restart

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Display services are restarted with the new high-resolution configuration applied.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Verifying high resolution configuration</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Checking that the display supports higher resolutions</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check Xorg log for dummy driver confirmation</span>
sudo grep -i <span style="color: #008000;">"dummy\|1920x1080\|modes"</span> /var/log/Xorg.0.log | tail -10

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Exit SSH session</span>
<span style="color: #0000FF; font-weight: bold;">exit</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test connection with higher resolution</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Reconnect with NoMachine - you should now see resolutions up to 1920x1080 available"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"In NoMachine client: Connection Settings &#8594; Display &#8594; Select desired resolution"</span>
</pre>
</div>

<p>
<b>Result:</b> High resolution configuration is verified and ready for NoMachine connections with full resolution support.
</p>
</div>
</div>
<div id="outline-container-orgb0c76d3" class="outline-4">
<h4 id="orgb0c76d3"><span class="section-number-4">11.1.8.</span> German Keyboard Configuration Fix</h4>
<div class="outline-text-4" id="text-11-1-8">
<p>
For users with German keyboards, the NoMachine GUI may default to English keyboard layout even when SSH connections work correctly. This occurs because XFCE desktop settings use an incorrect keyboard model that prevents proper key mapping.
</p>
</div>
<div id="outline-container-orga3391f4" class="outline-5">
<h5 id="orga3391f4"><span class="section-number-5">11.1.8.1.</span> Problem Diagnosis</h5>
<div class="outline-text-5" id="text-11-1-8-1">
<p>
The issue manifests as:
</p>
<ul class="org-ul">
<li>SSH terminal connections recognize German keyboard correctly</li>
<li>NoMachine GUI session only offers English keyboard layouts</li>
<li>Keys produce wrong characters (e.g., 'z' and 'y' swapped, special characters missing)</li>
</ul>

<p>
Root cause: XFCE keyboard model set to "genius" instead of "pc105" (standard PC keyboard).
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Diagnosing keyboard configuration issue</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Checking current keyboard settings in NoMachine session</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check system-level keyboard configuration</span>
localectl status

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check XFCE keyboard configuration</span>
cat ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display current keyboard configuration in X11</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Note: This command only works from within an active X session</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Run this in a terminal inside NoMachine: setxkbmap -query</span>

<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Diagnosis reveals incorrect keyboard model ("genius" instead of "pc105") in XFCE configuration.
</p>
</div>
</div>
