private-rag.org
**** Solution: Update XFCE Keyboard Configuration

This corrects the keyboard model to enable proper German keyboard mapping.

#+begin_src bash
# Listing: Fixing XFCE keyboard model configuration
# Updating keyboard model from "genius" to "pc105"

ssh EC2-RagFlow

# Backup existing configuration
cp ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml \
   ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml.backup

# Update XFCE keyboard configuration with correct model
cat > ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml << 'EOF'
<?xml version="1.0" encoding="UTF-8"?>

<channel name="keyboard-layout" version="1.0">
  <property name="Default" type="empty">
    <property name="XkbDisable" type="bool" value="false"/>
    <property name="XkbLayout" type="string" value="de,us"/>
    <property name="XkbVariant" type="string" value=","/>
    <property name="XkbModel" type="string" value="pc105"/>
  </property>
</channel>
EOF

# Verify the configuration was updated
cat ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml

exit
#+end_src

*Result:* XFCE keyboard configuration is updated with the correct pc105 model supporting both German and US layouts.

**** Solution: Add Session Startup Script

This ensures keyboard settings are applied automatically on each login.

#+begin_src bash
# Listing: Creating session startup script for keyboard
# Ensuring keyboard layout persists across sessions

ssh EC2-RagFlow

# Create .xprofile for automatic keyboard configuration
echo "#!/bin/bash" > ~/.xprofile
echo "# Set keyboard layout for X session" >> ~/.xprofile
echo "setxkbmap -model pc105 -layout de,us -variant , -option grp:alt_shift_toggle" >> ~/.xprofile

# Make the script executable
chmod +x ~/.xprofile

# Verify the script was created
cat ~/.xprofile

exit
#+end_src

*Result:* Session startup script is created to automatically apply German keyboard layout with Alt+Shift toggle between German and US layouts.

**** Applying the Fix

Log out of the NoMachine session and reconnect to apply the changes.

#+begin_src bash
# Listing: Verifying keyboard fix
# Testing the corrected configuration

# After reconnecting to NoMachine, open a terminal and verify:
# setxkbmap -query
# Expected output should show:
# model: pc105 (not "genius")
# layout: de,us

# Test German keyboard:
# - Try typing German special characters: ä ö ü ß
# - Use Alt+Shift to toggle between de and us layouts
# - Verify 'z' and 'y' keys produce correct characters

echo "German keyboard should now work correctly in NoMachine GUI"
echo "Use Alt+Shift to toggle between German (de) and US (us) keyboard layouts"
#+end_src

*Result:* German keyboard functions correctly in NoMachine GUI with Alt+Shift toggle for layout switching.


** Summary

NoMachine installation provides high-performance remote desktop access to the EC2 instance. The configuration includes security group updates, desktop environment setup, and firewall configuration. This complements SSH and RustDesk access with optimized graphical remote management capabilities.


* End

