private-rag.html
<div id="outline-container-org1520e36" class="outline-5">
<h5 id="org1520e36"><span class="section-number-5">11.1.8.2.</span> Solution: Update XFCE Keyboard Configuration</h5>
<div class="outline-text-5" id="text-11-1-8-2">
<p>
This corrects the keyboard model to enable proper German keyboard mapping.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Fixing XFCE keyboard model configuration</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Updating keyboard model from "genius" to "pc105"</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Backup existing configuration</span>
cp ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml <span style="color: #008000;">\</span>
   ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml.backup

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Update XFCE keyboard configuration with correct model</span>
cat &gt; ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml &lt;&lt; <span style="color: #008000;">'EOF'</span>
<span style="color: #0000ff; background-color: #EEF5FE;">&lt;?xml version="1.0" encoding="UTF-8"?&gt;</span>

<span style="color: #0000ff; background-color: #EEF5FE;">&lt;channel name="keyboard-layout" version="1.0"&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">  &lt;property name="Default" type="empty"&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    &lt;property name="XkbDisable" type="bool" value="false"/&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    &lt;property name="XkbLayout" type="string" value="de,us"/&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    &lt;property name="XkbVariant" type="string" value=","/&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">    &lt;property name="XkbModel" type="string" value="pc105"/&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">  &lt;/property&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">&lt;/channel&gt;</span>
<span style="color: #0000ff; background-color: #EEF5FE;">EOF</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the configuration was updated</span>
cat ~/.config/xfce4/xfconf/xfce-perchannel-xml/keyboard-layout.xml

<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> XFCE keyboard configuration is updated with the correct pc105 model supporting both German and US layouts.
</p>
</div>
</div>
<div id="outline-container-org40c7dbe" class="outline-5">
<h5 id="org40c7dbe"><span class="section-number-5">11.1.8.3.</span> Solution: Add Session Startup Script</h5>
<div class="outline-text-5" id="text-11-1-8-3">
<p>
This ensures keyboard settings are applied automatically on each login.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Creating session startup script for keyboard</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Ensuring keyboard layout persists across sessions</span>

ssh EC2-RagFlow

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create .xprofile for automatic keyboard configuration</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"#!/bin/bash"</span> &gt; ~/.xprofile
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"# Set keyboard layout for X session"</span> &gt;&gt; ~/.xprofile
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"setxkbmap -model pc105 -layout de,us -variant , -option grp:alt_shift_toggle"</span> &gt;&gt; ~/.xprofile

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Make the script executable</span>
chmod +x ~/.xprofile

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Verify the script was created</span>
cat ~/.xprofile

<span style="color: #0000FF; font-weight: bold;">exit</span>
</pre>
</div>

<p>
<b>Result:</b> Session startup script is created to automatically apply German keyboard layout with Alt+Shift toggle between German and US layouts.
</p>
</div>
</div>
<div id="outline-container-org297437c" class="outline-5">
<h5 id="org297437c"><span class="section-number-5">11.1.8.4.</span> Applying the Fix</h5>
<div class="outline-text-5" id="text-11-1-8-4">
<p>
Log out of the NoMachine session and reconnect to apply the changes.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Listing: Verifying keyboard fix</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Testing the corrected configuration</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">After reconnecting to NoMachine, open a terminal and verify:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">setxkbmap -query</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Expected output should show:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">model: pc105 (not "genius")</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">layout: de,us</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Test German keyboard:</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">- Try typing German special characters: &#228; &#246; &#252; &#223;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">- Use Alt+Shift to toggle between de and us layouts</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">- Verify 'z' and 'y' keys produce correct characters</span>

<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"German keyboard should now work correctly in NoMachine GUI"</span>
<span style="color: #006FE0;">echo</span> <span style="color: #008000;">"Use Alt+Shift to toggle between German (de) and US (us) keyboard layouts"</span>
</pre>
</div>

<p>
<b>Result:</b> German keyboard functions correctly in NoMachine GUI with Alt+Shift toggle for layout switching.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org80b6a64" class="outline-3">
<h3 id="org80b6a64"><span class="section-number-3">11.2.</span> Summary</h3>
<div class="outline-text-3" id="text-11-2">
<p>
NoMachine installation provides high-performance remote desktop access to the EC2 instance. The configuration includes security group updates, desktop environment setup, and firewall configuration. This complements SSH and RustDesk access with optimized graphical remote management capabilities.
</p>
</div>
</div>
</div>
<div id="outline-container-orgca67355" class="outline-2">
<h2 id="orgca67355"><span class="section-number-2">12.</span> End</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-11-04</p>
<p class="author">Author: Andreas Wittmann</p>
<p class="date">Created: 2025-11-11 Tue 14:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
